/**
 * Bundled by jsDelivr using Rollup v2.79.2 and Terser v5.39.0.
 * Original file: /npm/@vue/devtools-kit@7.7.6/dist/index.js
 *
 * Do NOT use SRI with dynamically generated files! More information: https://www.jsdelivr.com/using-sri-with-dynamic-files
 */
import {target as e, isNuxtApp as t, isBrowser as n, isUrlString as o, classify as r, basename as i, deepClone as a, camelize as s, kebabize as l} from "./devtools-shared.js";
import {debounce as c} from "../perfect-debounce.js";
import {createHooks as u} from "../hookable.js";
import {createBirpc as p, createBirpcGroup as d} from "../birpc.js";
var _, f, m, E = Object.create, h = Object.defineProperty, v = Object.getOwnPropertyDescriptor, y = Object.getOwnPropertyNames, g = Object.getPrototypeOf, O = Object.prototype.hasOwnProperty, T = (e, t) => function() {
    return t || (0,
        e[y(e)[0]])((t = {
        exports: {}
    }).exports, t),
        t.exports
}
    , I = (_ = {
        "../../node_modules/.pnpm/tsup@8.4.0_@microsoft+api-extractor@7.51.1_@types+node@22.13.14__jiti@2.4.2_postcss@8.5_96eb05a9d65343021e53791dd83f3773/node_modules/tsup/assets/esm_shims.js"() {}
    },
        function() {
            return _ && (f = (0,
                _[y(_)[0]])(_ = 0)),
                f
        }
), S = T({
    "../../node_modules/.pnpm/speakingurl@14.0.1/node_modules/speakingurl/es/speakingurl.js"(e, t) {
        I(),
            function(e) {
                var n = {
                    "À": "A",
                    "Á": "A",
                    "Â": "A",
                    "Ã": "A",
                    "Ä": "Ae",
                    "Å": "A",
                    "Æ": "AE",
                    "Ç": "C",
                    "È": "E",
                    "É": "E",
                    "Ê": "E",
                    "Ë": "E",
                    "Ì": "I",
                    "Í": "I",
                    "Î": "I",
                    "Ï": "I",
                    "Ð": "D",
                    "Ñ": "N",
                    "Ò": "O",
                    "Ó": "O",
                    "Ô": "O",
                    "Õ": "O",
                    "Ö": "Oe",
                    "Ő": "O",
                    "Ø": "O",
                    "Ù": "U",
                    "Ú": "U",
                    "Û": "U",
                    "Ü": "Ue",
                    "Ű": "U",
                    "Ý": "Y",
                    "Þ": "TH",
                    "ß": "ss",
                    "à": "a",
                    "á": "a",
                    "â": "a",
                    "ã": "a",
                    "ä": "ae",
                    "å": "a",
                    "æ": "ae",
                    "ç": "c",
                    "è": "e",
                    "é": "e",
                    "ê": "e",
                    "ë": "e",
                    "ì": "i",
                    "í": "i",
                    "î": "i",
                    "ï": "i",
                    "ð": "d",
                    "ñ": "n",
                    "ò": "o",
                    "ó": "o",
                    "ô": "o",
                    "õ": "o",
                    "ö": "oe",
                    "ő": "o",
                    "ø": "o",
                    "ù": "u",
                    "ú": "u",
                    "û": "u",
                    "ü": "ue",
                    "ű": "u",
                    "ý": "y",
                    "þ": "th",
                    "ÿ": "y",
                    "ẞ": "SS",
                    "ا": "a",
                    "أ": "a",
                    "إ": "i",
                    "آ": "aa",
                    "ؤ": "u",
                    "ئ": "e",
                    "ء": "a",
                    "ب": "b",
                    "ت": "t",
                    "ث": "th",
                    "ج": "j",
                    "ح": "h",
                    "خ": "kh",
                    "د": "d",
                    "ذ": "th",
                    "ر": "r",
                    "ز": "z",
                    "س": "s",
                    "ش": "sh",
                    "ص": "s",
                    "ض": "dh",
                    "ط": "t",
                    "ظ": "z",
                    "ع": "a",
                    "غ": "gh",
                    "ف": "f",
                    "ق": "q",
                    "ك": "k",
                    "ل": "l",
                    "م": "m",
                    "ن": "n",
                    "ه": "h",
                    "و": "w",
                    "ي": "y",
                    "ى": "a",
                    "ة": "h",
                    "ﻻ": "la",
                    "ﻷ": "laa",
                    "ﻹ": "lai",
                    "ﻵ": "laa",
                    "گ": "g",
                    "چ": "ch",
                    "پ": "p",
                    "ژ": "zh",
                    "ک": "k",
                    "ی": "y",
                    "َ": "a",
                    "ً": "an",
                    "ِ": "e",
                    "ٍ": "en",
                    "ُ": "u",
                    "ٌ": "on",
                    "ْ": "",
                    "٠": "0",
                    "١": "1",
                    "٢": "2",
                    "٣": "3",
                    "٤": "4",
                    "٥": "5",
                    "٦": "6",
                    "٧": "7",
                    "٨": "8",
                    "٩": "9",
                    "۰": "0",
                    "۱": "1",
                    "۲": "2",
                    "۳": "3",
                    "۴": "4",
                    "۵": "5",
                    "۶": "6",
                    "۷": "7",
                    "۸": "8",
                    "۹": "9",
                    "က": "k",
                    "ခ": "kh",
                    "ဂ": "g",
                    "ဃ": "ga",
                    "င": "ng",
                    "စ": "s",
                    "ဆ": "sa",
                    "ဇ": "z",
                    "စျ": "za",
                    "ည": "ny",
                    "ဋ": "t",
                    "ဌ": "ta",
                    "ဍ": "d",
                    "ဎ": "da",
                    "ဏ": "na",
                    "တ": "t",
                    "ထ": "ta",
                    "ဒ": "d",
                    "ဓ": "da",
                    "န": "n",
                    "ပ": "p",
                    "ဖ": "pa",
                    "ဗ": "b",
                    "ဘ": "ba",
                    "မ": "m",
                    "ယ": "y",
                    "ရ": "ya",
                    "လ": "l",
                    "ဝ": "w",
                    "သ": "th",
                    "ဟ": "h",
                    "ဠ": "la",
                    "အ": "a",
                    "ြ": "y",
                    "ျ": "ya",
                    "ွ": "w",
                    "ြွ": "yw",
                    "ျွ": "ywa",
                    "ှ": "h",
                    "ဧ": "e",
                    "၏": "-e",
                    "ဣ": "i",
                    "ဤ": "-i",
                    "ဉ": "u",
                    "ဦ": "-u",
                    "ဩ": "aw",
                    "သြော": "aw",
                    "ဪ": "aw",
                    "၀": "0",
                    "၁": "1",
                    "၂": "2",
                    "၃": "3",
                    "၄": "4",
                    "၅": "5",
                    "၆": "6",
                    "၇": "7",
                    "၈": "8",
                    "၉": "9",
                    "္": "",
                    "့": "",
                    "း": "",
                    "č": "c",
                    "ď": "d",
                    "ě": "e",
                    "ň": "n",
                    "ř": "r",
                    "š": "s",
                    "ť": "t",
                    "ů": "u",
                    "ž": "z",
                    "Č": "C",
                    "Ď": "D",
                    "Ě": "E",
                    "Ň": "N",
                    "Ř": "R",
                    "Š": "S",
                    "Ť": "T",
                    "Ů": "U",
                    "Ž": "Z",
                    "ހ": "h",
                    "ށ": "sh",
                    "ނ": "n",
                    "ރ": "r",
                    "ބ": "b",
                    "ޅ": "lh",
                    "ކ": "k",
                    "އ": "a",
                    "ވ": "v",
                    "މ": "m",
                    "ފ": "f",
                    "ދ": "dh",
                    "ތ": "th",
                    "ލ": "l",
                    "ގ": "g",
                    "ޏ": "gn",
                    "ސ": "s",
                    "ޑ": "d",
                    "ޒ": "z",
                    "ޓ": "t",
                    "ޔ": "y",
                    "ޕ": "p",
                    "ޖ": "j",
                    "ޗ": "ch",
                    "ޘ": "tt",
                    "ޙ": "hh",
                    "ޚ": "kh",
                    "ޛ": "th",
                    "ޜ": "z",
                    "ޝ": "sh",
                    "ޞ": "s",
                    "ޟ": "d",
                    "ޠ": "t",
                    "ޡ": "z",
                    "ޢ": "a",
                    "ޣ": "gh",
                    "ޤ": "q",
                    "ޥ": "w",
                    "ަ": "a",
                    "ާ": "aa",
                    "ި": "i",
                    "ީ": "ee",
                    "ު": "u",
                    "ޫ": "oo",
                    "ެ": "e",
                    "ޭ": "ey",
                    "ޮ": "o",
                    "ޯ": "oa",
                    "ް": "",
                    "ა": "a",
                    "ბ": "b",
                    "გ": "g",
                    "დ": "d",
                    "ე": "e",
                    "ვ": "v",
                    "ზ": "z",
                    "თ": "t",
                    "ი": "i",
                    "კ": "k",
                    "ლ": "l",
                    "მ": "m",
                    "ნ": "n",
                    "ო": "o",
                    "პ": "p",
                    "ჟ": "zh",
                    "რ": "r",
                    "ს": "s",
                    "ტ": "t",
                    "უ": "u",
                    "ფ": "p",
                    "ქ": "k",
                    "ღ": "gh",
                    "ყ": "q",
                    "შ": "sh",
                    "ჩ": "ch",
                    "ც": "ts",
                    "ძ": "dz",
                    "წ": "ts",
                    "ჭ": "ch",
                    "ხ": "kh",
                    "ჯ": "j",
                    "ჰ": "h",
                    "α": "a",
                    "β": "v",
                    "γ": "g",
                    "δ": "d",
                    "ε": "e",
                    "ζ": "z",
                    "η": "i",
                    "θ": "th",
                    "ι": "i",
                    "κ": "k",
                    "λ": "l",
                    "μ": "m",
                    "ν": "n",
                    "ξ": "ks",
                    "ο": "o",
                    "π": "p",
                    "ρ": "r",
                    "σ": "s",
                    "τ": "t",
                    "υ": "y",
                    "φ": "f",
                    "χ": "x",
                    "ψ": "ps",
                    "ω": "o",
                    "ά": "a",
                    "έ": "e",
                    "ί": "i",
                    "ό": "o",
                    "ύ": "y",
                    "ή": "i",
                    "ώ": "o",
                    "ς": "s",
                    "ϊ": "i",
                    "ΰ": "y",
                    "ϋ": "y",
                    "ΐ": "i",
                    "Α": "A",
                    "Β": "B",
                    "Γ": "G",
                    "Δ": "D",
                    "Ε": "E",
                    "Ζ": "Z",
                    "Η": "I",
                    "Θ": "TH",
                    "Ι": "I",
                    "Κ": "K",
                    "Λ": "L",
                    "Μ": "M",
                    "Ν": "N",
                    "Ξ": "KS",
                    "Ο": "O",
                    "Π": "P",
                    "Ρ": "R",
                    "Σ": "S",
                    "Τ": "T",
                    "Υ": "Y",
                    "Φ": "F",
                    "Χ": "X",
                    "Ψ": "PS",
                    "Ω": "O",
                    "Ά": "A",
                    "Έ": "E",
                    "Ί": "I",
                    "Ό": "O",
                    "Ύ": "Y",
                    "Ή": "I",
                    "Ώ": "O",
                    "Ϊ": "I",
                    "Ϋ": "Y",
                    "ā": "a",
                    "ē": "e",
                    "ģ": "g",
                    "ī": "i",
                    "ķ": "k",
                    "ļ": "l",
                    "ņ": "n",
                    "ū": "u",
                    "Ā": "A",
                    "Ē": "E",
                    "Ģ": "G",
                    "Ī": "I",
                    "Ķ": "k",
                    "Ļ": "L",
                    "Ņ": "N",
                    "Ū": "U",
                    "Ќ": "Kj",
                    "ќ": "kj",
                    "Љ": "Lj",
                    "љ": "lj",
                    "Њ": "Nj",
                    "њ": "nj",
                    "Тс": "Ts",
                    "тс": "ts",
                    "ą": "a",
                    "ć": "c",
                    "ę": "e",
                    "ł": "l",
                    "ń": "n",
                    "ś": "s",
                    "ź": "z",
                    "ż": "z",
                    "Ą": "A",
                    "Ć": "C",
                    "Ę": "E",
                    "Ł": "L",
                    "Ń": "N",
                    "Ś": "S",
                    "Ź": "Z",
                    "Ż": "Z",
                    "Є": "Ye",
                    "І": "I",
                    "Ї": "Yi",
                    "Ґ": "G",
                    "є": "ye",
                    "і": "i",
                    "ї": "yi",
                    "ґ": "g",
                    "ă": "a",
                    "Ă": "A",
                    "ș": "s",
                    "Ș": "S",
                    "ț": "t",
                    "Ț": "T",
                    "ţ": "t",
                    "Ţ": "T",
                    "а": "a",
                    "б": "b",
                    "в": "v",
                    "г": "g",
                    "д": "d",
                    "е": "e",
                    "ё": "yo",
                    "ж": "zh",
                    "з": "z",
                    "и": "i",
                    "й": "i",
                    "к": "k",
                    "л": "l",
                    "м": "m",
                    "н": "n",
                    "о": "o",
                    "п": "p",
                    "р": "r",
                    "с": "s",
                    "т": "t",
                    "у": "u",
                    "ф": "f",
                    "х": "kh",
                    "ц": "c",
                    "ч": "ch",
                    "ш": "sh",
                    "щ": "sh",
                    "ъ": "",
                    "ы": "y",
                    "ь": "",
                    "э": "e",
                    "ю": "yu",
                    "я": "ya",
                    "А": "A",
                    "Б": "B",
                    "В": "V",
                    "Г": "G",
                    "Д": "D",
                    "Е": "E",
                    "Ё": "Yo",
                    "Ж": "Zh",
                    "З": "Z",
                    "И": "I",
                    "Й": "I",
                    "К": "K",
                    "Л": "L",
                    "М": "M",
                    "Н": "N",
                    "О": "O",
                    "П": "P",
                    "Р": "R",
                    "С": "S",
                    "Т": "T",
                    "У": "U",
                    "Ф": "F",
                    "Х": "Kh",
                    "Ц": "C",
                    "Ч": "Ch",
                    "Ш": "Sh",
                    "Щ": "Sh",
                    "Ъ": "",
                    "Ы": "Y",
                    "Ь": "",
                    "Э": "E",
                    "Ю": "Yu",
                    "Я": "Ya",
                    "ђ": "dj",
                    "ј": "j",
                    "ћ": "c",
                    "џ": "dz",
                    "Ђ": "Dj",
                    "Ј": "j",
                    "Ћ": "C",
                    "Џ": "Dz",
                    "ľ": "l",
                    "ĺ": "l",
                    "ŕ": "r",
                    "Ľ": "L",
                    "Ĺ": "L",
                    "Ŕ": "R",
                    "ş": "s",
                    "Ş": "S",
                    "ı": "i",
                    "İ": "I",
                    "ğ": "g",
                    "Ğ": "G",
                    "ả": "a",
                    "Ả": "A",
                    "ẳ": "a",
                    "Ẳ": "A",
                    "ẩ": "a",
                    "Ẩ": "A",
                    "đ": "d",
                    "Đ": "D",
                    "ẹ": "e",
                    "Ẹ": "E",
                    "ẽ": "e",
                    "Ẽ": "E",
                    "ẻ": "e",
                    "Ẻ": "E",
                    "ế": "e",
                    "Ế": "E",
                    "ề": "e",
                    "Ề": "E",
                    "ệ": "e",
                    "Ệ": "E",
                    "ễ": "e",
                    "Ễ": "E",
                    "ể": "e",
                    "Ể": "E",
                    "ỏ": "o",
                    "ọ": "o",
                    "Ọ": "o",
                    "ố": "o",
                    "Ố": "O",
                    "ồ": "o",
                    "Ồ": "O",
                    "ổ": "o",
                    "Ổ": "O",
                    "ộ": "o",
                    "Ộ": "O",
                    "ỗ": "o",
                    "Ỗ": "O",
                    "ơ": "o",
                    "Ơ": "O",
                    "ớ": "o",
                    "Ớ": "O",
                    "ờ": "o",
                    "Ờ": "O",
                    "ợ": "o",
                    "Ợ": "O",
                    "ỡ": "o",
                    "Ỡ": "O",
                    "Ở": "o",
                    "ở": "o",
                    "ị": "i",
                    "Ị": "I",
                    "ĩ": "i",
                    "Ĩ": "I",
                    "ỉ": "i",
                    "Ỉ": "i",
                    "ủ": "u",
                    "Ủ": "U",
                    "ụ": "u",
                    "Ụ": "U",
                    "ũ": "u",
                    "Ũ": "U",
                    "ư": "u",
                    "Ư": "U",
                    "ứ": "u",
                    "Ứ": "U",
                    "ừ": "u",
                    "Ừ": "U",
                    "ự": "u",
                    "Ự": "U",
                    "ữ": "u",
                    "Ữ": "U",
                    "ử": "u",
                    "Ử": "ư",
                    "ỷ": "y",
                    "Ỷ": "y",
                    "ỳ": "y",
                    "Ỳ": "Y",
                    "ỵ": "y",
                    "Ỵ": "Y",
                    "ỹ": "y",
                    "Ỹ": "Y",
                    "ạ": "a",
                    "Ạ": "A",
                    "ấ": "a",
                    "Ấ": "A",
                    "ầ": "a",
                    "Ầ": "A",
                    "ậ": "a",
                    "Ậ": "A",
                    "ẫ": "a",
                    "Ẫ": "A",
                    "ắ": "a",
                    "Ắ": "A",
                    "ằ": "a",
                    "Ằ": "A",
                    "ặ": "a",
                    "Ặ": "A",
                    "ẵ": "a",
                    "Ẵ": "A",
                    "⓪": "0",
                    "①": "1",
                    "②": "2",
                    "③": "3",
                    "④": "4",
                    "⑤": "5",
                    "⑥": "6",
                    "⑦": "7",
                    "⑧": "8",
                    "⑨": "9",
                    "⑩": "10",
                    "⑪": "11",
                    "⑫": "12",
                    "⑬": "13",
                    "⑭": "14",
                    "⑮": "15",
                    "⑯": "16",
                    "⑰": "17",
                    "⑱": "18",
                    "⑲": "18",
                    "⑳": "18",
                    "⓵": "1",
                    "⓶": "2",
                    "⓷": "3",
                    "⓸": "4",
                    "⓹": "5",
                    "⓺": "6",
                    "⓻": "7",
                    "⓼": "8",
                    "⓽": "9",
                    "⓾": "10",
                    "⓿": "0",
                    "⓫": "11",
                    "⓬": "12",
                    "⓭": "13",
                    "⓮": "14",
                    "⓯": "15",
                    "⓰": "16",
                    "⓱": "17",
                    "⓲": "18",
                    "⓳": "19",
                    "⓴": "20",
                    "Ⓐ": "A",
                    "Ⓑ": "B",
                    "Ⓒ": "C",
                    "Ⓓ": "D",
                    "Ⓔ": "E",
                    "Ⓕ": "F",
                    "Ⓖ": "G",
                    "Ⓗ": "H",
                    "Ⓘ": "I",
                    "Ⓙ": "J",
                    "Ⓚ": "K",
                    "Ⓛ": "L",
                    "Ⓜ": "M",
                    "Ⓝ": "N",
                    "Ⓞ": "O",
                    "Ⓟ": "P",
                    "Ⓠ": "Q",
                    "Ⓡ": "R",
                    "Ⓢ": "S",
                    "Ⓣ": "T",
                    "Ⓤ": "U",
                    "Ⓥ": "V",
                    "Ⓦ": "W",
                    "Ⓧ": "X",
                    "Ⓨ": "Y",
                    "Ⓩ": "Z",
                    "ⓐ": "a",
                    "ⓑ": "b",
                    "ⓒ": "c",
                    "ⓓ": "d",
                    "ⓔ": "e",
                    "ⓕ": "f",
                    "ⓖ": "g",
                    "ⓗ": "h",
                    "ⓘ": "i",
                    "ⓙ": "j",
                    "ⓚ": "k",
                    "ⓛ": "l",
                    "ⓜ": "m",
                    "ⓝ": "n",
                    "ⓞ": "o",
                    "ⓟ": "p",
                    "ⓠ": "q",
                    "ⓡ": "r",
                    "ⓢ": "s",
                    "ⓣ": "t",
                    "ⓤ": "u",
                    "ⓦ": "v",
                    "ⓥ": "w",
                    "ⓧ": "x",
                    "ⓨ": "y",
                    "ⓩ": "z",
                    "“": '"',
                    "”": '"',
                    "‘": "'",
                    "’": "'",
                    "∂": "d",
                    "ƒ": "f",
                    "™": "(TM)",
                    "©": "(C)",
                    "œ": "oe",
                    "Œ": "OE",
                    "®": "(R)",
                    "†": "+",
                    "℠": "(SM)",
                    "…": "...",
                    "˚": "o",
                    "º": "o",
                    "ª": "a",
                    "•": "*",
                    "၊": ",",
                    "။": ".",
                    $: "USD",
                    "€": "EUR",
                    "₢": "BRN",
                    "₣": "FRF",
                    "£": "GBP",
                    "₤": "ITL",
                    "₦": "NGN",
                    "₧": "ESP",
                    "₩": "KRW",
                    "₪": "ILS",
                    "₫": "VND",
                    "₭": "LAK",
                    "₮": "MNT",
                    "₯": "GRD",
                    "₱": "ARS",
                    "₲": "PYG",
                    "₳": "ARA",
                    "₴": "UAH",
                    "₵": "GHS",
                    "¢": "cent",
                    "¥": "CNY",
                    "元": "CNY",
                    "円": "YEN",
                    "﷼": "IRR",
                    "₠": "EWE",
                    "฿": "THB",
                    "₨": "INR",
                    "₹": "INR",
                    "₰": "PF",
                    "₺": "TRY",
                    "؋": "AFN",
                    "₼": "AZN",
                    "лв": "BGN",
                    "៛": "KHR",
                    "₡": "CRC",
                    "₸": "KZT",
                    "ден": "MKD",
                    "zł": "PLN",
                    "₽": "RUB",
                    "₾": "GEL"
                }
                    , o = ["်", "ް"]
                    , r = {
                    "ာ": "a",
                    "ါ": "a",
                    "ေ": "e",
                    "ဲ": "e",
                    "ိ": "i",
                    "ီ": "i",
                    "ို": "o",
                    "ု": "u",
                    "ူ": "u",
                    "ေါင်": "aung",
                    "ော": "aw",
                    "ော်": "aw",
                    "ေါ": "aw",
                    "ေါ်": "aw",
                    "်": "်",
                    "က်": "et",
                    "ိုက်": "aik",
                    "ောက်": "auk",
                    "င်": "in",
                    "ိုင်": "aing",
                    "ောင်": "aung",
                    "စ်": "it",
                    "ည်": "i",
                    "တ်": "at",
                    "ိတ်": "eik",
                    "ုတ်": "ok",
                    "ွတ်": "ut",
                    "ေတ်": "it",
                    "ဒ်": "d",
                    "ိုဒ်": "ok",
                    "ုဒ်": "ait",
                    "န်": "an",
                    "ာန်": "an",
                    "ိန်": "ein",
                    "ုန်": "on",
                    "ွန်": "un",
                    "ပ်": "at",
                    "ိပ်": "eik",
                    "ုပ်": "ok",
                    "ွပ်": "ut",
                    "န်ုပ်": "nub",
                    "မ်": "an",
                    "ိမ်": "ein",
                    "ုမ်": "on",
                    "ွမ်": "un",
                    "ယ်": "e",
                    "ိုလ်": "ol",
                    "ဉ်": "in",
                    "ံ": "an",
                    "ိံ": "ein",
                    "ုံ": "on",
                    "ައް": "ah",
                    "ަށް": "ah"
                }
                    , i = {
                    en: {},
                    az: {
                        "ç": "c",
                        "ə": "e",
                        "ğ": "g",
                        "ı": "i",
                        "ö": "o",
                        "ş": "s",
                        "ü": "u",
                        "Ç": "C",
                        "Ə": "E",
                        "Ğ": "G",
                        "İ": "I",
                        "Ö": "O",
                        "Ş": "S",
                        "Ü": "U"
                    },
                    cs: {
                        "č": "c",
                        "ď": "d",
                        "ě": "e",
                        "ň": "n",
                        "ř": "r",
                        "š": "s",
                        "ť": "t",
                        "ů": "u",
                        "ž": "z",
                        "Č": "C",
                        "Ď": "D",
                        "Ě": "E",
                        "Ň": "N",
                        "Ř": "R",
                        "Š": "S",
                        "Ť": "T",
                        "Ů": "U",
                        "Ž": "Z"
                    },
                    fi: {
                        "ä": "a",
                        "Ä": "A",
                        "ö": "o",
                        "Ö": "O"
                    },
                    hu: {
                        "ä": "a",
                        "Ä": "A",
                        "ö": "o",
                        "Ö": "O",
                        "ü": "u",
                        "Ü": "U",
                        "ű": "u",
                        "Ű": "U"
                    },
                    lt: {
                        "ą": "a",
                        "č": "c",
                        "ę": "e",
                        "ė": "e",
                        "į": "i",
                        "š": "s",
                        "ų": "u",
                        "ū": "u",
                        "ž": "z",
                        "Ą": "A",
                        "Č": "C",
                        "Ę": "E",
                        "Ė": "E",
                        "Į": "I",
                        "Š": "S",
                        "Ų": "U",
                        "Ū": "U"
                    },
                    lv: {
                        "ā": "a",
                        "č": "c",
                        "ē": "e",
                        "ģ": "g",
                        "ī": "i",
                        "ķ": "k",
                        "ļ": "l",
                        "ņ": "n",
                        "š": "s",
                        "ū": "u",
                        "ž": "z",
                        "Ā": "A",
                        "Č": "C",
                        "Ē": "E",
                        "Ģ": "G",
                        "Ī": "i",
                        "Ķ": "k",
                        "Ļ": "L",
                        "Ņ": "N",
                        "Š": "S",
                        "Ū": "u",
                        "Ž": "Z"
                    },
                    pl: {
                        "ą": "a",
                        "ć": "c",
                        "ę": "e",
                        "ł": "l",
                        "ń": "n",
                        "ó": "o",
                        "ś": "s",
                        "ź": "z",
                        "ż": "z",
                        "Ą": "A",
                        "Ć": "C",
                        "Ę": "e",
                        "Ł": "L",
                        "Ń": "N",
                        "Ó": "O",
                        "Ś": "S",
                        "Ź": "Z",
                        "Ż": "Z"
                    },
                    sv: {
                        "ä": "a",
                        "Ä": "A",
                        "ö": "o",
                        "Ö": "O"
                    },
                    sk: {
                        "ä": "a",
                        "Ä": "A"
                    },
                    sr: {
                        "љ": "lj",
                        "њ": "nj",
                        "Љ": "Lj",
                        "Њ": "Nj",
                        "đ": "dj",
                        "Đ": "Dj"
                    },
                    tr: {
                        "Ü": "U",
                        "Ö": "O",
                        "ü": "u",
                        "ö": "o"
                    }
                }
                    , a = {
                    ar: {
                        "∆": "delta",
                        "∞": "la-nihaya",
                        "♥": "hob",
                        "&": "wa",
                        "|": "aw",
                        "<": "aqal-men",
                        ">": "akbar-men",
                        "∑": "majmou",
                        "¤": "omla"
                    },
                    az: {},
                    ca: {
                        "∆": "delta",
                        "∞": "infinit",
                        "♥": "amor",
                        "&": "i",
                        "|": "o",
                        "<": "menys que",
                        ">": "mes que",
                        "∑": "suma dels",
                        "¤": "moneda"
                    },
                    cs: {
                        "∆": "delta",
                        "∞": "nekonecno",
                        "♥": "laska",
                        "&": "a",
                        "|": "nebo",
                        "<": "mensi nez",
                        ">": "vetsi nez",
                        "∑": "soucet",
                        "¤": "mena"
                    },
                    de: {
                        "∆": "delta",
                        "∞": "unendlich",
                        "♥": "Liebe",
                        "&": "und",
                        "|": "oder",
                        "<": "kleiner als",
                        ">": "groesser als",
                        "∑": "Summe von",
                        "¤": "Waehrung"
                    },
                    dv: {
                        "∆": "delta",
                        "∞": "kolunulaa",
                        "♥": "loabi",
                        "&": "aai",
                        "|": "noonee",
                        "<": "ah vure kuda",
                        ">": "ah vure bodu",
                        "∑": "jumula",
                        "¤": "faisaa"
                    },
                    en: {
                        "∆": "delta",
                        "∞": "infinity",
                        "♥": "love",
                        "&": "and",
                        "|": "or",
                        "<": "less than",
                        ">": "greater than",
                        "∑": "sum",
                        "¤": "currency"
                    },
                    es: {
                        "∆": "delta",
                        "∞": "infinito",
                        "♥": "amor",
                        "&": "y",
                        "|": "u",
                        "<": "menos que",
                        ">": "mas que",
                        "∑": "suma de los",
                        "¤": "moneda"
                    },
                    fa: {
                        "∆": "delta",
                        "∞": "bi-nahayat",
                        "♥": "eshgh",
                        "&": "va",
                        "|": "ya",
                        "<": "kamtar-az",
                        ">": "bishtar-az",
                        "∑": "majmooe",
                        "¤": "vahed"
                    },
                    fi: {
                        "∆": "delta",
                        "∞": "aarettomyys",
                        "♥": "rakkaus",
                        "&": "ja",
                        "|": "tai",
                        "<": "pienempi kuin",
                        ">": "suurempi kuin",
                        "∑": "summa",
                        "¤": "valuutta"
                    },
                    fr: {
                        "∆": "delta",
                        "∞": "infiniment",
                        "♥": "Amour",
                        "&": "et",
                        "|": "ou",
                        "<": "moins que",
                        ">": "superieure a",
                        "∑": "somme des",
                        "¤": "monnaie"
                    },
                    ge: {
                        "∆": "delta",
                        "∞": "usasruloba",
                        "♥": "siqvaruli",
                        "&": "da",
                        "|": "an",
                        "<": "naklebi",
                        ">": "meti",
                        "∑": "jami",
                        "¤": "valuta"
                    },
                    gr: {},
                    hu: {
                        "∆": "delta",
                        "∞": "vegtelen",
                        "♥": "szerelem",
                        "&": "es",
                        "|": "vagy",
                        "<": "kisebb mint",
                        ">": "nagyobb mint",
                        "∑": "szumma",
                        "¤": "penznem"
                    },
                    it: {
                        "∆": "delta",
                        "∞": "infinito",
                        "♥": "amore",
                        "&": "e",
                        "|": "o",
                        "<": "minore di",
                        ">": "maggiore di",
                        "∑": "somma",
                        "¤": "moneta"
                    },
                    lt: {
                        "∆": "delta",
                        "∞": "begalybe",
                        "♥": "meile",
                        "&": "ir",
                        "|": "ar",
                        "<": "maziau nei",
                        ">": "daugiau nei",
                        "∑": "suma",
                        "¤": "valiuta"
                    },
                    lv: {
                        "∆": "delta",
                        "∞": "bezgaliba",
                        "♥": "milestiba",
                        "&": "un",
                        "|": "vai",
                        "<": "mazak neka",
                        ">": "lielaks neka",
                        "∑": "summa",
                        "¤": "valuta"
                    },
                    my: {
                        "∆": "kwahkhyaet",
                        "∞": "asaonasme",
                        "♥": "akhyait",
                        "&": "nhin",
                        "|": "tho",
                        "<": "ngethaw",
                        ">": "kyithaw",
                        "∑": "paungld",
                        "¤": "ngwekye"
                    },
                    mk: {},
                    nl: {
                        "∆": "delta",
                        "∞": "oneindig",
                        "♥": "liefde",
                        "&": "en",
                        "|": "of",
                        "<": "kleiner dan",
                        ">": "groter dan",
                        "∑": "som",
                        "¤": "valuta"
                    },
                    pl: {
                        "∆": "delta",
                        "∞": "nieskonczonosc",
                        "♥": "milosc",
                        "&": "i",
                        "|": "lub",
                        "<": "mniejsze niz",
                        ">": "wieksze niz",
                        "∑": "suma",
                        "¤": "waluta"
                    },
                    pt: {
                        "∆": "delta",
                        "∞": "infinito",
                        "♥": "amor",
                        "&": "e",
                        "|": "ou",
                        "<": "menor que",
                        ">": "maior que",
                        "∑": "soma",
                        "¤": "moeda"
                    },
                    ro: {
                        "∆": "delta",
                        "∞": "infinit",
                        "♥": "dragoste",
                        "&": "si",
                        "|": "sau",
                        "<": "mai mic ca",
                        ">": "mai mare ca",
                        "∑": "suma",
                        "¤": "valuta"
                    },
                    ru: {
                        "∆": "delta",
                        "∞": "beskonechno",
                        "♥": "lubov",
                        "&": "i",
                        "|": "ili",
                        "<": "menshe",
                        ">": "bolshe",
                        "∑": "summa",
                        "¤": "valjuta"
                    },
                    sk: {
                        "∆": "delta",
                        "∞": "nekonecno",
                        "♥": "laska",
                        "&": "a",
                        "|": "alebo",
                        "<": "menej ako",
                        ">": "viac ako",
                        "∑": "sucet",
                        "¤": "mena"
                    },
                    sr: {},
                    tr: {
                        "∆": "delta",
                        "∞": "sonsuzluk",
                        "♥": "ask",
                        "&": "ve",
                        "|": "veya",
                        "<": "kucuktur",
                        ">": "buyuktur",
                        "∑": "toplam",
                        "¤": "para birimi"
                    },
                    uk: {
                        "∆": "delta",
                        "∞": "bezkinechnist",
                        "♥": "lubov",
                        "&": "i",
                        "|": "abo",
                        "<": "menshe",
                        ">": "bilshe",
                        "∑": "suma",
                        "¤": "valjuta"
                    },
                    vn: {
                        "∆": "delta",
                        "∞": "vo cuc",
                        "♥": "yeu",
                        "&": "va",
                        "|": "hoac",
                        "<": "nho hon",
                        ">": "lon hon",
                        "∑": "tong",
                        "¤": "tien te"
                    }
                }
                    , s = [";", "?", ":", "@", "&", "=", "+", "$", ",", "/"].join("")
                    , l = [";", "?", ":", "@", "&", "=", "+", "$", ","].join("")
                    , c = [".", "!", "~", "*", "'", "(", ")"].join("")
                    , u = function(e, t) {
                    var u, p, f, m, E, h, v, y, g, O, T, I, S, b, V = "-", k = "", D = "", C = !0, w = {}, L = "";
                    if ("string" != typeof e)
                        return "";
                    if ("string" == typeof t && (V = t),
                        v = a.en,
                        y = i.en,
                    "object" == typeof t)
                        for (T in u = t.maintainCase || !1,
                            w = t.custom && "object" == typeof t.custom ? t.custom : w,
                            f = +t.truncate > 1 && t.truncate || !1,
                            m = t.uric || !1,
                            E = t.uricNoSlash || !1,
                            h = t.mark || !1,
                            C = !1 !== t.symbols && !1 !== t.lang,
                            V = t.separator || V,
                        m && (L += s),
                        E && (L += l),
                        h && (L += c),
                            v = t.lang && a[t.lang] && C ? a[t.lang] : C ? a.en : {},
                            y = t.lang && i[t.lang] ? i[t.lang] : !1 === t.lang || !0 === t.lang ? {} : i.en,
                            t.titleCase && "number" == typeof t.titleCase.length && Array.prototype.toString.call(t.titleCase) ? (t.titleCase.forEach((function(e) {
                                    w[e + ""] = e + ""
                                }
                            )),
                                p = !0) : p = !!t.titleCase,
                        t.custom && "number" == typeof t.custom.length && Array.prototype.toString.call(t.custom) && t.custom.forEach((function(e) {
                                w[e + ""] = e + ""
                            }
                        )),
                            Object.keys(w).forEach((function(t) {
                                    var n;
                                    n = t.length > 1 ? new RegExp("\\b" + d(t) + "\\b","gi") : new RegExp(d(t),"gi"),
                                        e = e.replace(n, w[t])
                                }
                            )),
                            w)
                            L += T;
                    for (L = d(L += V),
                             S = !1,
                             b = !1,
                             O = 0,
                             I = (e = e.replace(/(^\s+|\s+$)/g, "")).length; O < I; O++)
                        T = e[O],
                            _(T, w) ? S = !1 : y[T] ? (T = S && y[T].match(/[A-Za-z0-9]/) ? " " + y[T] : y[T],
                                S = !1) : T in n ? (O + 1 < I && o.indexOf(e[O + 1]) >= 0 ? (D += T,
                                T = "") : !0 === b ? (T = r[D] + n[T],
                                D = "") : T = S && n[T].match(/[A-Za-z0-9]/) ? " " + n[T] : n[T],
                                S = !1,
                                b = !1) : T in r ? (D += T,
                                T = "",
                            O === I - 1 && (T = r[D]),
                                b = !0) : !v[T] || m && -1 !== s.indexOf(T) || E && -1 !== l.indexOf(T) ? (!0 === b ? (T = r[D] + T,
                                D = "",
                                b = !1) : S && (/[A-Za-z0-9]/.test(T) || k.substr(-1).match(/A-Za-z0-9]/)) && (T = " " + T),
                                S = !1) : (T = S || k.substr(-1).match(/[A-Za-z0-9]/) ? V + v[T] : v[T],
                                T += void 0 !== e[O + 1] && e[O + 1].match(/[A-Za-z0-9]/) ? V : "",
                                S = !0),
                            k += T.replace(new RegExp("[^\\w\\s" + L + "_-]","g"), V);
                    return p && (k = k.replace(/(\w)(\S*)/g, (function(e, t, n) {
                            var o = t.toUpperCase() + (null !== n ? n : "");
                            return Object.keys(w).indexOf(o.toLowerCase()) < 0 ? o : o.toLowerCase()
                        }
                    ))),
                        k = k.replace(/\s+/g, V).replace(new RegExp("\\" + V + "+","g"), V).replace(new RegExp("(^\\" + V + "+|\\" + V + "+$)","g"), ""),
                    f && k.length > f && (g = k.charAt(f) === V,
                        k = k.slice(0, f),
                    g || (k = k.slice(0, k.lastIndexOf(V)))),
                    u || p || (k = k.toLowerCase()),
                        k
                }
                    , p = function(e) {
                    return function(t) {
                        return u(t, e)
                    }
                }
                    , d = function(e) {
                    return e.replace(/[-\\^$*+?.()|[\]{}\/]/g, "\\$&")
                }
                    , _ = function(e, t) {
                    for (var n in t)
                        if (t[n] === e)
                            return !0
                };
                if (void 0 !== t && t.exports)
                    t.exports = u,
                        t.exports.createSlug = p;
                else if ("undefined" != typeof define && define.amd)
                    define([], (function() {
                            return u
                        }
                    ));
                else
                    try {
                        if (e.getSlug || e.createSlug)
                            throw "speakingurl: globals exists /(getSlug|createSlug)/";
                        e.getSlug = u,
                            e.createSlug = p
                    } catch (e) {}
            }(e)
    }
}), b = T({
    "../../node_modules/.pnpm/speakingurl@14.0.1/node_modules/speakingurl/index.js"(e, t) {
        I(),
            t.exports = S()
    }
});
function V(e) {
    const t = e.__file;
    if (t)
        return r(i(t, ".vue"))
}
function k(e, t) {
    return e.type.__VUE_DEVTOOLS_COMPONENT_GUSSED_NAME__ = t,
        t
}
function D(e) {
    return e.__VUE_DEVTOOLS_NEXT_APP_RECORD__ ? e.__VUE_DEVTOOLS_NEXT_APP_RECORD__ : e.root ? e.appContext.app.__VUE_DEVTOOLS_NEXT_APP_RECORD__ : void 0
}
async function C(e) {
    const {app: t, uid: n, instance: o} = e;
    try {
        if (o.__VUE_DEVTOOLS_NEXT_UID__)
            return o.__VUE_DEVTOOLS_NEXT_UID__;
        const e = await D(t);
        if (!e)
            return null;
        const r = e.rootInstance === o;
        return `${e.id}:${r ? "root" : n}`
    } catch (e) {}
}
function w(e) {
    var t, n;
    const o = null == (t = e.subTree) ? void 0 : t.type
        , r = D(e);
    return !!r && (null == (n = null == r ? void 0 : r.types) ? void 0 : n.Fragment) === o
}
function L(e) {
    return e._isBeingDestroyed || e.isUnmounted
}
function R(e) {
    var t, n, o;
    const r = function(e) {
        var t;
        const n = e.name || e._componentTag || e.__VUE_DEVTOOLS_COMPONENT_GUSSED_NAME__ || e.__name;
        return "index" === n && (null == (t = e.__file) ? void 0 : t.endsWith("index.vue")) ? "" : n
    }((null == e ? void 0 : e.type) || {});
    if (r)
        return r;
    if ((null == e ? void 0 : e.root) === e)
        return "Root";
    for (const o in null == (n = null == (t = e.parent) ? void 0 : t.type) ? void 0 : n.components)
        if (e.parent.type.components[o] === (null == e ? void 0 : e.type))
            return k(e, o);
    for (const t in null == (o = e.appContext) ? void 0 : o.components)
        if (e.appContext.components[t] === (null == e ? void 0 : e.type))
            return k(e, t);
    const i = V((null == e ? void 0 : e.type) || {});
    return i || "Anonymous Component"
}
function N(e) {
    var t, n, o;
    return `${null != (o = null == (n = null == (t = null == e ? void 0 : e.appContext) ? void 0 : t.app) ? void 0 : n.__VUE_DEVTOOLS_NEXT_APP_RECORD_ID__) ? o : 0}:${e === (null == e ? void 0 : e.root) ? "root" : e.uid}`
}
function P(e) {
    try {
        return e()
    } catch (e) {
        return e
    }
}
function A(e, t) {
    t = t || `${e.id}:root`;
    return e.instanceMap.get(t) || e.instanceMap.get(":root")
}
function U(e, t, n=!1) {
    return (n || "object" == typeof e && null !== e) && t in e
}
function x(e, t) {
    return (!e.top || t.top < e.top) && (e.top = t.top),
    (!e.bottom || t.bottom > e.bottom) && (e.bottom = t.bottom),
    (!e.left || t.left < e.left) && (e.left = t.left),
    (!e.right || t.right > e.right) && (e.right = t.right),
        e
}
I(),
    I(),
    I(),
    I(),
    I(),
    I(),
    I(),
    I();
var M = {
    top: 0,
    left: 0,
    right: 0,
    bottom: 0,
    width: 0,
    height: 0
};
function j(e) {
    const t = e.subTree.el;
    return "undefined" == typeof window ? M : w(e) ? function(e) {
        const t = function() {
            const e = {
                top: 0,
                bottom: 0,
                left: 0,
                right: 0,
                get width() {
                    return e.right - e.left
                },
                get height() {
                    return e.bottom - e.top
                }
            };
            return e
        }();
        if (!e.children)
            return t;
        for (let o = 0, r = e.children.length; o < r; o++) {
            const r = e.children[o];
            let i;
            if (r.component)
                i = j(r.component);
            else if (r.el) {
                const e = r.el;
                1 === e.nodeType || e.getBoundingClientRect ? i = e.getBoundingClientRect() : 3 === e.nodeType && e.data.trim() && (n = e,
                m || (m = document.createRange()),
                    m.selectNode(n),
                    i = m.getBoundingClientRect())
            }
            i && x(t, i)
        }
        var n;
        return t
    }(e.subTree) : 1 === (null == t ? void 0 : t.nodeType) ? null == t ? void 0 : t.getBoundingClientRect() : e.subTree.component ? j(e.subTree.component) : M
}
function K(e) {
    return w(e) ? function(e) {
        if (!e.children)
            return [];
        const t = [];
        return e.children.forEach((e => {
                e.component ? t.push(...K(e.component)) : (null == e ? void 0 : e.el) && t.push(e.el)
            }
        )),
            t
    }(e.subTree) : e.subTree ? [e.subTree.el] : []
}
I();
var $ = "__vue-devtools-component-inspector__"
    , H = "__vue-devtools-component-inspector__card__"
    , z = "__vue-devtools-component-inspector__name__"
    , B = "__vue-devtools-component-inspector__indicator__"
    , G = {
    display: "block",
    zIndex: 2147483640,
    position: "fixed",
    backgroundColor: "#42b88325",
    border: "1px solid #42b88350",
    borderRadius: "5px",
    transition: "all 0.1s ease-in",
    pointerEvents: "none"
}
    , F = {
    fontFamily: "Arial, Helvetica, sans-serif",
    padding: "5px 8px",
    borderRadius: "4px",
    textAlign: "left",
    position: "absolute",
    left: 0,
    color: "#e9e9e9",
    fontSize: "14px",
    fontWeight: 600,
    lineHeight: "24px",
    backgroundColor: "#42b883",
    boxShadow: "0 1px 3px 0 rgba(0, 0, 0, 0.1), 0 1px 2px -1px rgba(0, 0, 0, 0.1)"
}
    , X = {
    display: "inline-block",
    fontWeight: 400,
    fontStyle: "normal",
    fontSize: "12px",
    opacity: .7
};
function Y() {
    return document.getElementById($)
}
function q(e) {
    return {
        left: Math.round(100 * e.left) / 100 + "px",
        top: Math.round(100 * e.top) / 100 + "px",
        width: Math.round(100 * e.width) / 100 + "px",
        height: Math.round(100 * e.height) / 100 + "px"
    }
}
function W(e) {
    var t;
    const n = document.createElement("div");
    n.id = null != (t = e.elementId) ? t : $,
        Object.assign(n.style, {
            ...G,
            ...q(e.bounds),
            ...e.style
        });
    const o = document.createElement("span");
    o.id = H,
        Object.assign(o.style, {
            ...F,
            top: e.bounds.top < 35 ? 0 : "-35px"
        });
    const r = document.createElement("span");
    r.id = z,
        r.innerHTML = `&lt;${e.name}&gt;&nbsp;&nbsp;`;
    const i = document.createElement("i");
    return i.id = B,
        i.innerHTML = `${Math.round(100 * e.bounds.width) / 100} x ${Math.round(100 * e.bounds.height) / 100}`,
        Object.assign(i.style, X),
        o.appendChild(r),
        o.appendChild(i),
        n.appendChild(o),
        document.body.appendChild(n),
        n
}
function Z(e) {
    const t = Y()
        , n = document.getElementById(H)
        , o = document.getElementById(z)
        , r = document.getElementById(B);
    t && (Object.assign(t.style, {
        ...G,
        ...q(e.bounds)
    }),
        Object.assign(n.style, {
            top: e.bounds.top < 35 ? 0 : "-35px"
        }),
        o.innerHTML = `&lt;${e.name}&gt;&nbsp;&nbsp;`,
        r.innerHTML = `${Math.round(100 * e.bounds.width) / 100} x ${Math.round(100 * e.bounds.height) / 100}`)
}
function J() {
    const e = Y();
    e && (e.style.display = "none")
}
var Q = null;
function ee(e) {
    const t = e.target;
    if (t) {
        const e = t.__vueParentComponent;
        if (e) {
            Q = e;
            if (e.vnode.el) {
                const t = j(e)
                    , n = R(e);
                Y() ? Z({
                    bounds: t,
                    name: n
                }) : W({
                    bounds: t,
                    name: n
                })
            }
        }
    }
}
var te, ne = null;
function oe() {
    return window.addEventListener("mouseover", ee),
        new Promise((e => {
                function t(n) {
                    n.preventDefault(),
                        n.stopPropagation(),
                        function(e, t) {
                            e.preventDefault(),
                                e.stopPropagation(),
                            Q && t(N(Q))
                        }(n, (n => {
                                window.removeEventListener("click", t, !0),
                                    ne = null,
                                    window.removeEventListener("mouseover", ee);
                                const o = Y();
                                o && (o.style.display = "none"),
                                    e(JSON.stringify({
                                        id: n
                                    }))
                            }
                        ))
                }
                ne = t,
                    window.addEventListener("click", t, !0)
            }
        ))
}
function re(t) {
    e.__VUE_DEVTOOLS_COMPONENT_INSPECTOR_ENABLED__ = t
}
function ie() {
    return new Promise((t => {
            function n() {
                !function() {
                    const t = e.__VUE_INSPECTOR__
                        , n = t.openInEditor;
                    t.openInEditor = async (...e) => {
                        t.disable(),
                            n(...e)
                    }
                }(),
                    t(e.__VUE_INSPECTOR__)
            }
            e.__VUE_INSPECTOR__ ? n() : function(t) {
                let n = 0;
                const o = setInterval(( () => {
                        e.__VUE_INSPECTOR__ && (clearInterval(o),
                            n += 30,
                            t()),
                        n >= 5e3 && clearInterval(o)
                    }
                ), 30)
            }(( () => {
                    n()
                }
            ))
        }
    ))
}
function ae(e) {
    return function(e) {
        return !(!e || !e.__v_isReadonly)
    }(e) ? ae(e.__v_raw) : !(!e || !e.__v_isReactive)
}
function se(e) {
    return !(!e || !0 !== e.__v_isRef)
}
function le(e) {
    const t = e && e.__v_raw;
    return t ? le(t) : e
}
I(),
null != (te = e).__VUE_DEVTOOLS_COMPONENT_INSPECTOR_ENABLED__ || (te.__VUE_DEVTOOLS_COMPONENT_INSPECTOR_ENABLED__ = !0),
    I(),
    I();
var ce = class {
        constructor() {
            this.refEditor = new ue
        }
        set(e, t, n, o) {
            const r = Array.isArray(t) ? t : t.split(".");
            for (; r.length > 1; ) {
                const t = r.shift();
                e = e instanceof Map ? e.get(t) : e instanceof Set ? Array.from(e.values())[t] : e[t],
                this.refEditor.isRef(e) && (e = this.refEditor.get(e))
            }
            const i = r[0]
                , a = this.refEditor.get(e)[i];
            o ? o(e, i, n) : this.refEditor.isRef(a) ? this.refEditor.set(a, n) : e[i] = n
        }
        get(e, t) {
            const n = Array.isArray(t) ? t : t.split(".");
            for (let t = 0; t < n.length; t++)
                if (e = e instanceof Map ? e.get(n[t]) : e[n[t]],
                this.refEditor.isRef(e) && (e = this.refEditor.get(e)),
                    !e)
                    return;
            return e
        }
        has(e, t, n=!1) {
            if (void 0 === e)
                return !1;
            const o = Array.isArray(t) ? t.slice() : t.split(".")
                , r = n ? 2 : 1;
            for (; e && o.length > r; ) {
                e = e[o.shift()],
                this.refEditor.isRef(e) && (e = this.refEditor.get(e))
            }
            return null != e && Object.prototype.hasOwnProperty.call(e, o[0])
        }
        createDefaultSetCallback(e) {
            return (t, n, o) => {
                if ((e.remove || e.newKey) && (Array.isArray(t) ? t.splice(n, 1) : le(t)instanceof Map ? t.delete(n) : le(t)instanceof Set ? t.delete(Array.from(t.values())[n]) : Reflect.deleteProperty(t, n)),
                    !e.remove) {
                    const r = t[e.newKey || n];
                    this.refEditor.isRef(r) ? this.refEditor.set(r, o) : le(t)instanceof Map ? t.set(e.newKey || n, o) : le(t)instanceof Set ? t.add(o) : t[e.newKey || n] = o
                }
            }
        }
    }
    , ue = class {
        set(e, t) {
            if (se(e))
                e.value = t;
            else {
                if (e instanceof Set && Array.isArray(t))
                    return e.clear(),
                        void t.forEach((t => e.add(t)));
                const n = Object.keys(t);
                if (e instanceof Map) {
                    const o = new Set(e.keys());
                    return n.forEach((n => {
                            e.set(n, Reflect.get(t, n)),
                                o.delete(n)
                        }
                    )),
                        void o.forEach((t => e.delete(t)))
                }
                const o = new Set(Object.keys(e));
                n.forEach((n => {
                        Reflect.set(e, n, Reflect.get(t, n)),
                            o.delete(n)
                    }
                )),
                    o.forEach((t => Reflect.deleteProperty(e, t)))
            }
        }
        get(e) {
            return se(e) ? e.value : e
        }
        isRef(e) {
            return se(e) || ae(e)
        }
    }
;
var pe = new ce;
async function de(e) {
    !async function(e, t) {
        const {path: n, nodeId: o, state: r, type: i} = e
            , a = A(Be.value, o);
        if (!a)
            return;
        const s = n.slice();
        let l;
        l = Object.keys(a.props).includes(n[0]) ? a.props : a.devtoolsRawSetupState && Object.keys(a.devtoolsRawSetupState).includes(n[0]) ? a.devtoolsRawSetupState : a.data && Object.keys(a.data).includes(n[0]) ? a.data : a.proxy,
        l && s && (r.type,
            t.set(l, s, r.value, t.createDefaultSetCallback(r)))
    }(e, pe)
}
I(),
    I(),
    I();
var _e, fe = "__VUE_DEVTOOLS_KIT_TIMELINE_LAYERS_STATE__";
function me() {
    if (!n || "undefined" == typeof localStorage || null === localStorage)
        return {
            recordingState: !1,
            mouseEventEnabled: !1,
            keyboardEventEnabled: !1,
            componentEventEnabled: !1,
            performanceEventEnabled: !1,
            selected: ""
        };
    const e = localStorage.getItem(fe);
    return e ? JSON.parse(e) : {
        recordingState: !1,
        mouseEventEnabled: !1,
        keyboardEventEnabled: !1,
        componentEventEnabled: !1,
        performanceEventEnabled: !1,
        selected: ""
    }
}
I(),
    I(),
    I(),
null != (_e = e).__VUE_DEVTOOLS_KIT_TIMELINE_LAYERS || (_e.__VUE_DEVTOOLS_KIT_TIMELINE_LAYERS = []);
var Ee, he = new Proxy(e.__VUE_DEVTOOLS_KIT_TIMELINE_LAYERS,{
    get: (e, t, n) => Reflect.get(e, t, n)
});
function ve(e) {
    const t = {
        ...Ye.timelineLayersState,
        ...e
    };
    !function(e) {
        n && "undefined" != typeof localStorage && null !== localStorage && localStorage.setItem(fe, JSON.stringify(e))
    }(t),
        We({
            timelineLayersState: t
        })
}
null != (Ee = e).__VUE_DEVTOOLS_KIT_INSPECTOR__ || (Ee.__VUE_DEVTOOLS_KIT_INSPECTOR__ = []);
var ye = new Proxy(e.__VUE_DEVTOOLS_KIT_INSPECTOR__,{
    get: (e, t, n) => Reflect.get(e, t, n)
})
    , ge = c(( () => {
        yn.hooks.callHook("sendInspectorToClient", Te())
    }
));
function Oe(e, t) {
    var n, o;
    ye.push({
        options: e,
        descriptor: t,
        treeFilterPlaceholder: null != (n = e.treeFilterPlaceholder) ? n : "Search tree...",
        stateFilterPlaceholder: null != (o = e.stateFilterPlaceholder) ? o : "Search state...",
        treeFilter: "",
        selectedNodeId: "",
        appRecord: D(t.app)
    }),
        ge()
}
function Te() {
    return ye.filter((e => e.descriptor.app === Be.value.app)).filter((e => "components" !== e.descriptor.id)).map((e => {
            var t;
            const n = e.descriptor
                , o = e.options;
            return {
                id: o.id,
                label: o.label,
                logo: n.logo,
                icon: `custom-ic-baseline-${null == (t = null == o ? void 0 : o.icon) ? void 0 : t.replace(/_/g, "-")}`,
                packageName: n.packageName,
                homepage: n.homepage,
                pluginId: n.id
            }
        }
    ))
}
function Ie(e) {
    const t = Se(e, Be.value.app);
    if (!t)
        return;
    const n = t.descriptor
        , o = t.options
        , r = he.filter((e => e.descriptorId === n.id)).map((e => ({
        id: e.id,
        label: e.label,
        color: e.color
    })));
    return {
        id: o.id,
        label: o.label,
        logo: n.logo,
        packageName: n.packageName,
        homepage: n.homepage,
        timelineLayers: r,
        treeFilterPlaceholder: t.treeFilterPlaceholder,
        stateFilterPlaceholder: t.stateFilterPlaceholder
    }
}
function Se(e, t) {
    return ye.find((n => n.options.id === e && (!t || n.descriptor.app === t)))
}
function be(e) {
    const t = Se(e);
    return null == t ? void 0 : t.options.actions
}
function Ve(e) {
    const t = Se(e);
    return null == t ? void 0 : t.options.nodeActions
}
var ke, De, Ce, we, Le, Re = (e => (e.VISIT_COMPONENT_TREE = "visitComponentTree",
    e.INSPECT_COMPONENT = "inspectComponent",
    e.EDIT_COMPONENT_STATE = "editComponentState",
    e.GET_INSPECTOR_TREE = "getInspectorTree",
    e.GET_INSPECTOR_STATE = "getInspectorState",
    e.EDIT_INSPECTOR_STATE = "editInspectorState",
    e.INSPECT_TIMELINE_EVENT = "inspectTimelineEvent",
    e.TIMELINE_CLEARED = "timelineCleared",
    e.SET_PLUGIN_SETTINGS = "setPluginSettings",
    e))(Re || {}), Ne = (e => (e.ADD_INSPECTOR = "addInspector",
    e.SEND_INSPECTOR_TREE = "sendInspectorTree",
    e.SEND_INSPECTOR_STATE = "sendInspectorState",
    e.CUSTOM_INSPECTOR_SELECT_NODE = "customInspectorSelectNode",
    e.TIMELINE_LAYER_ADDED = "timelineLayerAdded",
    e.TIMELINE_EVENT_ADDED = "timelineEventAdded",
    e.GET_COMPONENT_INSTANCES = "getComponentInstances",
    e.GET_COMPONENT_BOUNDS = "getComponentBounds",
    e.GET_COMPONENT_NAME = "getComponentName",
    e.COMPONENT_HIGHLIGHT = "componentHighlight",
    e.COMPONENT_UNHIGHLIGHT = "componentUnhighlight",
    e))(Ne || {}), Pe = (e => (e.SEND_INSPECTOR_TREE_TO_CLIENT = "sendInspectorTreeToClient",
    e.SEND_INSPECTOR_STATE_TO_CLIENT = "sendInspectorStateToClient",
    e.SEND_TIMELINE_EVENT_TO_CLIENT = "sendTimelineEventToClient",
    e.SEND_INSPECTOR_TO_CLIENT = "sendInspectorToClient",
    e.SEND_ACTIVE_APP_UNMOUNTED_TO_CLIENT = "sendActiveAppUpdatedToClient",
    e.DEVTOOLS_STATE_UPDATED = "devtoolsStateUpdated",
    e.DEVTOOLS_CONNECTED_UPDATED = "devtoolsConnectedUpdated",
    e.ROUTER_INFO_UPDATED = "routerInfoUpdated",
    e))(Pe || {});
function Ae() {
    const e = u();
    e.hook("addInspector", ( ({inspector: e, plugin: t}) => {
            Oe(e, t.descriptor)
        }
    ));
    const t = c((async ({inspectorId: t, plugin: n}) => {
            var o;
            if (!t || !(null == (o = null == n ? void 0 : n.descriptor) ? void 0 : o.app) || Ye.highPerfModeEnabled)
                return;
            const r = Se(t, n.descriptor.app)
                , i = {
                app: n.descriptor.app,
                inspectorId: t,
                filter: (null == r ? void 0 : r.treeFilter) || "",
                rootNodes: []
            };
            await new Promise((t => {
                    e.callHookWith((async e => {
                            await Promise.all(e.map((e => e(i)))),
                                t()
                        }
                    ), "getInspectorTree")
                }
            )),
                e.callHookWith((async e => {
                        await Promise.all(e.map((e => e({
                            inspectorId: t,
                            rootNodes: i.rootNodes
                        }))))
                    }
                ), "sendInspectorTreeToClient")
        }
    ), 120);
    e.hook("sendInspectorTree", t);
    const n = c((async ({inspectorId: t, plugin: n}) => {
            var o;
            if (!t || !(null == (o = null == n ? void 0 : n.descriptor) ? void 0 : o.app) || Ye.highPerfModeEnabled)
                return;
            const r = Se(t, n.descriptor.app)
                , i = {
                app: n.descriptor.app,
                inspectorId: t,
                nodeId: (null == r ? void 0 : r.selectedNodeId) || "",
                state: null
            }
                , a = {
                currentTab: `custom-inspector:${t}`
            };
            i.nodeId && await new Promise((t => {
                    e.callHookWith((async e => {
                            await Promise.all(e.map((e => e(i, a)))),
                                t()
                        }
                    ), "getInspectorState")
                }
            )),
                e.callHookWith((async e => {
                        await Promise.all(e.map((e => e({
                            inspectorId: t,
                            nodeId: i.nodeId,
                            state: i.state
                        }))))
                    }
                ), "sendInspectorStateToClient")
        }
    ), 120);
    return e.hook("sendInspectorState", n),
        e.hook("customInspectorSelectNode", ( ({inspectorId: e, nodeId: t, plugin: n}) => {
                const o = Se(e, n.descriptor.app);
                o && (o.selectedNodeId = t)
            }
        )),
        e.hook("timelineLayerAdded", ( ({options: e, plugin: t}) => {
                !function(e, t) {
                    Ye.timelineLayersState[t.id] = !1,
                        he.push({
                            ...e,
                            descriptorId: t.id,
                            appRecord: D(t.app)
                        })
                }(e, t.descriptor)
            }
        )),
        e.hook("timelineEventAdded", ( ({options: t, plugin: n}) => {
                var o;
                Ye.highPerfModeEnabled || !(null == (o = Ye.timelineLayersState) ? void 0 : o[n.descriptor.id]) && !["performance", "component-event", "keyboard", "mouse"].includes(t.layerId) || e.callHookWith((async e => {
                        await Promise.all(e.map((e => e(t))))
                    }
                ), "sendTimelineEventToClient")
            }
        )),
        e.hook("getComponentInstances", (async ({app: e}) => {
                const t = e.__VUE_DEVTOOLS_NEXT_APP_RECORD__;
                if (!t)
                    return null;
                const n = t.id.toString();
                return [...t.instanceMap].filter(( ([e]) => e.split(":")[0] === n)).map(( ([,e]) => e))
            }
        )),
        e.hook("getComponentBounds", (async ({instance: e}) => j(e))),
        e.hook("getComponentName", ( ({instance: e}) => R(e))),
        e.hook("componentHighlight", ( ({uid: e}) => {
                const t = Be.value.instanceMap.get(e);
                t && function(e) {
                    const t = j(e);
                    if (!t.width && !t.height)
                        return;
                    const n = R(e);
                    Y() ? Z({
                        bounds: t,
                        name: n
                    }) : W({
                        bounds: t,
                        name: n
                    })
                }(t)
            }
        )),
        e.hook("componentUnhighlight", ( () => {
                J()
            }
        )),
        e
}
null != (ke = e).__VUE_DEVTOOLS_KIT_APP_RECORDS__ || (ke.__VUE_DEVTOOLS_KIT_APP_RECORDS__ = []),
null != (De = e).__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD__ || (De.__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD__ = {}),
null != (Ce = e).__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD_ID__ || (Ce.__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD_ID__ = ""),
null != (we = e).__VUE_DEVTOOLS_KIT_CUSTOM_TABS__ || (we.__VUE_DEVTOOLS_KIT_CUSTOM_TABS__ = []),
null != (Le = e).__VUE_DEVTOOLS_KIT_CUSTOM_COMMANDS__ || (Le.__VUE_DEVTOOLS_KIT_CUSTOM_COMMANDS__ = []);
var Ue, xe = "__VUE_DEVTOOLS_KIT_GLOBAL_STATE__";
function Me() {
    return {
        connected: !1,
        clientConnected: !1,
        vitePluginDetected: !0,
        appRecords: [],
        activeAppRecordId: "",
        tabs: [],
        commands: [],
        highPerfModeEnabled: !0,
        devtoolsClientDetected: {},
        perfUniqueGroupId: 0,
        timelineLayersState: me()
    }
}
null != (Ue = e)[xe] || (Ue[xe] = Me());
var je = c((e => {
        yn.hooks.callHook("devtoolsStateUpdated", {
            state: e
        })
    }
))
    , Ke = c(( (e, t) => {
        yn.hooks.callHook("devtoolsConnectedUpdated", {
            state: e,
            oldState: t
        })
    }
))
    , $e = new Proxy(e.__VUE_DEVTOOLS_KIT_APP_RECORDS__,{
    get: (t, n, o) => "value" === n ? e.__VUE_DEVTOOLS_KIT_APP_RECORDS__ : e.__VUE_DEVTOOLS_KIT_APP_RECORDS__[n]
})
    , He = t => {
    e.__VUE_DEVTOOLS_KIT_APP_RECORDS__ = [...e.__VUE_DEVTOOLS_KIT_APP_RECORDS__, t]
}
    , ze = t => {
    e.__VUE_DEVTOOLS_KIT_APP_RECORDS__ = $e.value.filter((e => e.app !== t))
}
    , Be = new Proxy(e.__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD__,{
    get: (t, n, o) => "value" === n ? e.__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD__ : "id" === n ? e.__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD_ID__ : e.__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD__[n]
});
function Ge() {
    je({
        ...e[xe],
        appRecords: $e.value,
        activeAppRecordId: Be.id,
        tabs: e.__VUE_DEVTOOLS_KIT_CUSTOM_TABS__,
        commands: e.__VUE_DEVTOOLS_KIT_CUSTOM_COMMANDS__
    })
}
function Fe(t) {
    e.__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD__ = t,
        Ge()
}
function Xe(t) {
    e.__VUE_DEVTOOLS_KIT_ACTIVE_APP_RECORD_ID__ = t,
        Ge()
}
var Ye = new Proxy(e[xe],{
    get: (t, n) => "appRecords" === n ? $e : "activeAppRecordId" === n ? Be.id : "tabs" === n ? e.__VUE_DEVTOOLS_KIT_CUSTOM_TABS__ : "commands" === n ? e.__VUE_DEVTOOLS_KIT_CUSTOM_COMMANDS__ : e[xe][n],
    deleteProperty: (e, t) => (delete e[t],
        !0),
    set: (t, n, o) => (e[xe],
        t[n] = o,
        e[xe][n] = o,
        !0)
});
function qe() {
    Object.assign(e[xe], Me())
}
function We(t) {
    const n = {
        ...e[xe],
        appRecords: $e.value,
        activeAppRecordId: Be.id
    };
    (n.connected !== t.connected && t.connected || n.clientConnected !== t.clientConnected && t.clientConnected) && Ke(e[xe], n),
        Object.assign(e[xe], t),
        Ge()
}
function Ze(e) {
    return new Promise((t => {
            Ye.connected && (e(),
                t()),
                yn.hooks.hook("devtoolsConnectedUpdated", ( ({state: n}) => {
                        n.connected && (e(),
                            t())
                    }
                ))
        }
    ))
}
var Je, Qe = e => {
        if (e)
            return e.startsWith("baseline-") ? `custom-ic-${e}` : e.startsWith("i-") || o(e) ? e : `custom-ic-baseline-${e}`
    }
;
function et(t) {
    const n = e.__VUE_DEVTOOLS_KIT_CUSTOM_TABS__;
    n.some((e => e.name === t.name)) || (n.push({
        ...t,
        icon: Qe(t.icon)
    }),
        Ge())
}
function tt(t) {
    const n = e.__VUE_DEVTOOLS_KIT_CUSTOM_COMMANDS__;
    n.some((e => e.id === t.id)) || (n.push({
        ...t,
        icon: Qe(t.icon),
        children: t.children ? t.children.map((e => ({
            ...e,
            icon: Qe(e.icon)
        }))) : void 0
    }),
        Ge())
}
function nt(t) {
    const n = e.__VUE_DEVTOOLS_KIT_CUSTOM_COMMANDS__
        , o = n.findIndex((e => e.id === t));
    -1 !== o && (n.splice(o, 1),
        Ge())
}
function ot(e) {
    We({
        clientConnected: e
    })
}
function rt(t) {
    e.__VUE_DEVTOOLS_OPEN_IN_EDITOR_BASE_URL__ = t
}
function it(t={}) {
    var n, o, r;
    const {file: i, host: a, baseUrl: s=window.location.origin, line: l=0, column: c=0} = t;
    if (i)
        if ("chrome-extension" === a) {
            const e = i.replace(/\\/g, "\\\\")
                , t = null != (o = null == (n = window.VUE_DEVTOOLS_CONFIG) ? void 0 : n.openInEditorHost) ? o : "/";
            fetch(`${t}__open-in-editor?file=${encodeURI(i)}`).then((t => {
                    if (!t.ok) {
                        const t = `Opening component ${e} failed`;
                        console.log(`%c${t}`, "color:red")
                    }
                }
            ))
        } else if (Ye.vitePluginDetected) {
            const t = null != (r = e.__VUE_DEVTOOLS_OPEN_IN_EDITOR_BASE_URL__) ? r : s;
            e.__VUE_INSPECTOR__.openInEditor(t, i, l, c)
        }
}
I(),
    I(),
    I(),
    I(),
    I(),
null != (Je = e).__VUE_DEVTOOLS_KIT_PLUGIN_BUFFER__ || (Je.__VUE_DEVTOOLS_KIT_PLUGIN_BUFFER__ = []);
var at, st, lt = new Proxy(e.__VUE_DEVTOOLS_KIT_PLUGIN_BUFFER__,{
    get: (e, t, n) => Reflect.get(e, t, n)
});
function ct(e, t) {
    lt.push([e, t])
}
function ut(e) {
    const t = {};
    return Object.keys(e).forEach((n => {
            t[n] = e[n].defaultValue
        }
    )),
        t
}
function pt(e) {
    return `__VUE_DEVTOOLS_NEXT_PLUGIN_SETTINGS__${e}__`
}
function dt(e) {
    var t, n, o;
    const r = null != (n = null == (t = lt.find((t => {
            var n;
            return t[0].id === e && !!(null == (n = t[0]) ? void 0 : n.settings)
        }
    ))) ? void 0 : t[0]) ? n : null;
    return null != (o = null == r ? void 0 : r.settings) ? o : null
}
function _t(e, t) {
    var n, o, r;
    const i = pt(e);
    if (i) {
        const e = localStorage.getItem(i);
        if (e)
            return JSON.parse(e)
    }
    if (e) {
        const t = null != (o = null == (n = lt.find((t => t[0].id === e))) ? void 0 : n[0]) ? o : null;
        return ut(null != (r = null == t ? void 0 : t.settings) ? r : {})
    }
    return ut(t)
}
function ft(e, t) {
    const n = pt(e);
    localStorage.getItem(n) || localStorage.setItem(n, JSON.stringify(ut(t)))
}
I(),
    I(),
    I(),
    I(),
    I(),
    I(),
    I(),
    I(),
    I(),
    I(),
    I();
var mt = null != (st = (at = e).__VUE_DEVTOOLS_HOOK) ? st : at.__VUE_DEVTOOLS_HOOK = u()
    , Et = {
    vueAppInit(e) {
        mt.hook("app:init", e)
    },
    vueAppUnmount(e) {
        mt.hook("app:unmount", e)
    },
    vueAppConnected(e) {
        mt.hook("app:connected", e)
    },
    componentAdded: e => mt.hook("component:added", e),
    componentEmit: e => mt.hook("component:emit", e),
    componentUpdated: e => mt.hook("component:updated", e),
    componentRemoved: e => mt.hook("component:removed", e),
    setupDevtoolsPlugin(e) {
        mt.hook("devtools-plugin:setup", e)
    },
    perfStart: e => mt.hook("perf:start", e),
    perfEnd: e => mt.hook("perf:end", e)
};
var ht = {
        on: Et,
        setupDevToolsPlugin: (e, t) => mt.callHook("devtools-plugin:setup", e, t)
    }
    , vt = class {
        constructor({plugin: e, ctx: t}) {
            this.hooks = t.hooks,
                this.plugin = e
        }
        get on() {
            return {
                visitComponentTree: e => {
                    this.hooks.hook("visitComponentTree", e)
                }
                ,
                inspectComponent: e => {
                    this.hooks.hook("inspectComponent", e)
                }
                ,
                editComponentState: e => {
                    this.hooks.hook("editComponentState", e)
                }
                ,
                getInspectorTree: e => {
                    this.hooks.hook("getInspectorTree", e)
                }
                ,
                getInspectorState: e => {
                    this.hooks.hook("getInspectorState", e)
                }
                ,
                editInspectorState: e => {
                    this.hooks.hook("editInspectorState", e)
                }
                ,
                inspectTimelineEvent: e => {
                    this.hooks.hook("inspectTimelineEvent", e)
                }
                ,
                timelineCleared: e => {
                    this.hooks.hook("timelineCleared", e)
                }
                ,
                setPluginSettings: e => {
                    this.hooks.hook("setPluginSettings", e)
                }
            }
        }
        notifyComponentUpdate(e) {
            var t;
            if (Ye.highPerfModeEnabled)
                return;
            const n = Te().find((e => e.packageName === this.plugin.descriptor.packageName));
            if (null == n ? void 0 : n.id) {
                if (e) {
                    const n = [e.appContext.app, e.uid, null == (t = e.parent) ? void 0 : t.uid, e];
                    mt.callHook("component:updated", ...n)
                } else
                    mt.callHook("component:updated");
                this.hooks.callHook("sendInspectorState", {
                    inspectorId: n.id,
                    plugin: this.plugin
                })
            }
        }
        addInspector(e) {
            this.hooks.callHook("addInspector", {
                inspector: e,
                plugin: this.plugin
            }),
            this.plugin.descriptor.settings && ft(e.id, this.plugin.descriptor.settings)
        }
        sendInspectorTree(e) {
            Ye.highPerfModeEnabled || this.hooks.callHook("sendInspectorTree", {
                inspectorId: e,
                plugin: this.plugin
            })
        }
        sendInspectorState(e) {
            Ye.highPerfModeEnabled || this.hooks.callHook("sendInspectorState", {
                inspectorId: e,
                plugin: this.plugin
            })
        }
        selectInspectorNode(e, t) {
            this.hooks.callHook("customInspectorSelectNode", {
                inspectorId: e,
                nodeId: t,
                plugin: this.plugin
            })
        }
        visitComponentTree(e) {
            return this.hooks.callHook("visitComponentTree", e)
        }
        now() {
            return Ye.highPerfModeEnabled ? 0 : Date.now()
        }
        addTimelineLayer(e) {
            this.hooks.callHook("timelineLayerAdded", {
                options: e,
                plugin: this.plugin
            })
        }
        addTimelineEvent(e) {
            Ye.highPerfModeEnabled || this.hooks.callHook("timelineEventAdded", {
                options: e,
                plugin: this.plugin
            })
        }
        getSettings(e) {
            return _t(null != e ? e : this.plugin.descriptor.id, this.plugin.descriptor.settings)
        }
        getComponentInstances(e) {
            return this.hooks.callHook("getComponentInstances", {
                app: e
            })
        }
        getComponentBounds(e) {
            return this.hooks.callHook("getComponentBounds", {
                instance: e
            })
        }
        getComponentName(e) {
            return this.hooks.callHook("getComponentName", {
                instance: e
            })
        }
        highlightElement(e) {
            const t = e.__VUE_DEVTOOLS_NEXT_UID__;
            return this.hooks.callHook("componentHighlight", {
                uid: t
            })
        }
        unhighlightElement() {
            return this.hooks.callHook("componentUnhighlight")
        }
    }
;
I(),
    I(),
    I(),
    I();
var yt = new Set(["nextTick", "defineComponent", "defineAsyncComponent", "defineCustomElement", "ref", "computed", "reactive", "readonly", "watchEffect", "watchPostEffect", "watchSyncEffect", "watch", "isRef", "unref", "toRef", "toRefs", "isProxy", "isReactive", "isReadonly", "shallowRef", "triggerRef", "customRef", "shallowReactive", "shallowReadonly", "toRaw", "markRaw", "effectScope", "getCurrentScope", "onScopeDispose", "onMounted", "onUpdated", "onUnmounted", "onBeforeMount", "onBeforeUpdate", "onBeforeUnmount", "onErrorCaptured", "onRenderTracked", "onRenderTriggered", "onActivated", "onDeactivated", "onServerPrefetch", "provide", "inject", "h", "mergeProps", "cloneVNode", "isVNode", "resolveComponent", "resolveDirective", "withDirectives", "withModifiers"])
    , gt = /^\[native Symbol Symbol\((.*)\)\]$/
    , Ot = /^\[object (\w+)\]$/
    , Tt = /^\[native (\w+) (.*?)(<>(([\s\S])*))?\]$/
    , It = /^(?:function|class) (\w+)/
    , St = "__vue_devtool_undefined__"
    , bt = "__vue_devtool_infinity__"
    , Vt = "__vue_devtool_negative_infinity__"
    , kt = "__vue_devtool_nan__"
    , Dt = {
    "<": "&lt;",
    ">": "&gt;",
    '"': "&quot;",
    "&": "&amp;"
};
function Ct(e) {
    return !!U(e, "_") && (!!wt(e._) && Object.keys(e._).includes("vnode"))
}
function wt(e) {
    return "[object Object]" === Object.prototype.toString.call(e)
}
function Lt(e) {
    return !!e.__v_isRef
}
function Rt(e) {
    return Lt(e) && !!e.effect
}
function Nt(e) {
    return !!e.__v_isReactive
}
function Pt(e) {
    return !!e.__v_isReadonly
}
I(),
    I();
var At = {
    [St]: "undefined",
    [kt]: "NaN",
    [bt]: "Infinity",
    [Vt]: "-Infinity"
}
    , Ut = Object.entries(At).reduce(( (e, [t,n]) => (e[n] = t,
    e)), {});
function xt(e) {
    if (Array.isArray(e))
        return e.map((e => xt(e))).join(" or ");
    if (null == e)
        return "null";
    const t = e.toString().match(It);
    return "function" == typeof e && t && t[1] || "any"
}
function Mt(e) {
    try {
        return {
            ref: Lt(e),
            computed: Rt(e),
            reactive: Nt(e),
            readonly: Pt(e)
        }
    } catch (e) {
        return {
            ref: !1,
            computed: !1,
            reactive: !1,
            readonly: !1
        }
    }
}
function jt(e) {
    return (null == e ? void 0 : e.__v_raw) ? e.__v_raw : e
}
function Kt(e) {
    return e.replace(/[<>"&]/g, (e => Dt[e] || e))
}
function $t(e, t, n) {
    if ("function" == typeof t && (t = t.options),
        !t)
        return e;
    const {mixins: o, extends: r} = t;
    r && $t(e, r),
    o && o.forEach((t => $t(e, t)));
    for (const n of ["computed", "inject"])
        Object.prototype.hasOwnProperty.call(t, n) && (e[n] ? Object.assign(e[n], t[n]) : e[n] = t[n]);
    return e
}
function Ht(e) {
    const t = function(e) {
        const t = null == e ? void 0 : e.type;
        if (!t)
            return {};
        const {mixins: n, extends: o} = t
            , r = e.appContext.mixins;
        if (!r.length && !n && !o)
            return t;
        const i = {};
        return r.forEach((e => $t(i, e))),
            $t(i, t),
            i
    }(e);
    return function(e) {
        var t;
        const n = []
            , o = null == (t = null == e ? void 0 : e.type) ? void 0 : t.props;
        for (const t in null == e ? void 0 : e.props) {
            const r = o ? o[t] : null
                , i = s(t);
            n.push({
                type: "props",
                key: i,
                value: P(( () => e.props[t])),
                editable: !0,
                meta: r ? {
                    type: r.type ? xt(r.type) : "any",
                    required: !!r.required,
                    ...r.default ? {
                        default: r.default.toString()
                    } : {}
                } : {
                    type: "invalid"
                }
            })
        }
        return n
    }(e).concat(function(e) {
        const t = e.type
            , n = null == t ? void 0 : t.props
            , o = t.vuex && t.vuex.getters
            , r = t.computed
            , i = {
            ...e.data,
            ...e.renderContext
        };
        return Object.keys(i).filter((e => !(n && e in n || o && e in o || r && e in r))).map((e => ({
            key: e,
            type: "data",
            value: P(( () => i[e])),
            editable: !0
        })))
    }(e), function(e) {
        const t = e.devtoolsRawSetupState || {};
        return Object.keys(e.setupState).filter((e => !yt.has(e) && "use" !== e.split(/(?=[A-Z])/)[0])).map((n => {
                var o, r, i, a;
                const s = P(( () => jt(e.setupState[n])))
                    , l = s instanceof Error
                    , c = t[n];
                let u, p = l || "function" == typeof s || U(s, "render") && "function" == typeof s.render || U(s, "__asyncLoader") && "function" == typeof s.__asyncLoader || "object" == typeof s && s && ("setup"in s || "props"in s) || /^v[A-Z]/.test(n);
                if (c && !l) {
                    const e = Mt(c)
                        , {stateType: t, stateTypeName: n} = function(e) {
                        const t = e.computed ? "computed" : e.ref ? "ref" : e.reactive ? "reactive" : null
                            , n = t ? `${t.charAt(0).toUpperCase()}${t.slice(1)}` : null;
                        return {
                            stateType: t,
                            stateTypeName: n
                        }
                    }(e)
                        , s = e.ref || e.computed || e.reactive
                        , l = U(c, "effect") ? (null == (r = null == (o = c.effect) ? void 0 : o.raw) ? void 0 : r.toString()) || (null == (a = null == (i = c.effect) ? void 0 : i.fn) ? void 0 : a.toString()) : null;
                    t && (p = !1),
                        u = {
                            ...t ? {
                                stateType: t,
                                stateTypeName: n
                            } : {},
                            ...l ? {
                                raw: l
                            } : {},
                            editable: s && !e.readonly
                        }
                }
                return {
                    key: n,
                    value: s,
                    type: p ? "setup (other)" : "setup",
                    ...u
                }
            }
        ))
    }(e), function(e, t) {
        const n = []
            , o = t.computed || {};
        for (const t in o) {
            const r = o[t]
                , i = "function" == typeof r && r.vuex ? "vuex bindings" : "computed";
            n.push({
                type: i,
                key: t,
                value: P(( () => {
                        var n;
                        return null == (n = null == e ? void 0 : e.proxy) ? void 0 : n[t]
                    }
                )),
                editable: "function" == typeof r.set
            })
        }
        return n
    }(e, t), function(e) {
        return Object.keys(e.attrs).map((t => ({
            type: "attrs",
            key: t,
            value: P(( () => e.attrs[t]))
        })))
    }(e), function(e) {
        return Reflect.ownKeys(e.provides).map((t => ({
            type: "provided",
            key: t.toString(),
            value: P(( () => e.provides[t]))
        })))
    }(e), function(e, t) {
        if (!(null == t ? void 0 : t.inject))
            return [];
        let n, o = [];
        return o = Array.isArray(t.inject) ? t.inject.map((e => ({
            key: e,
            originalKey: e
        }))) : Reflect.ownKeys(t.inject).map((e => {
                const o = t.inject[e];
                let r;
                return "string" == typeof o || "symbol" == typeof o ? r = o : (r = o.from,
                    n = o.default),
                    {
                        key: e,
                        originalKey: r
                    }
            }
        )),
            o.map(( ({key: t, originalKey: o}) => ({
                type: "injected",
                key: o && t !== o ? `${o.toString()} ➞ ${t.toString()}` : t.toString(),
                value: P(( () => e.ctx.hasOwnProperty(t) ? e.ctx[t] : e.provides.hasOwnProperty(o) ? e.provides[o] : n))
            })))
    }(e, t), function(e) {
        return Object.keys(e.refs).map((t => ({
            type: "template refs",
            key: t,
            value: P(( () => e.refs[t]))
        })))
    }(e), function(e) {
        var t, n;
        const o = e.type.emits
            , r = Array.isArray(o) ? o : Object.keys(null != o ? o : {})
            , i = Object.keys(null != (n = null == (t = null == e ? void 0 : e.vnode) ? void 0 : t.props) ? n : {})
            , a = [];
        for (const e of i) {
            const [t,...n] = e.split(/(?=[A-Z])/);
            if ("on" === t) {
                const e = n.join("-").toLowerCase()
                    , t = r.includes(e);
                a.push({
                    type: "event listeners",
                    key: e,
                    value: {
                        _custom: {
                            displayText: t ? "✅ Declared" : "⚠️ Not declared",
                            key: t ? "✅ Declared" : "⚠️ Not declared",
                            value: t ? "✅ Declared" : "⚠️ Not declared",
                            tooltipText: t ? null : `The event <code>${e}</code> is not declared in the <code>emits</code> option. It will leak into the component's attributes (<code>$attrs</code>).`
                        }
                    }
                })
            }
        }
        return a
    }(e))
}
I(),
    I();
var zt = class {
        constructor(e) {
            this.filter = e || ""
        }
        isQualified(e) {
            const t = R(e);
            return r(t).toLowerCase().includes(this.filter) || l(t).toLowerCase().includes(this.filter)
        }
    }
;
var Bt = class {
        constructor(e) {
            this.captureIds = new Map;
            const {filterText: t="", maxDepth: n, recursively: o, api: r} = e;
            this.componentFilter = function(e) {
                return new zt(e)
            }(t),
                this.maxDepth = n,
                this.recursively = o,
                this.api = r
        }
        getComponentTree(e) {
            return this.captureIds = new Map,
                this.findQualifiedChildren(e, 0)
        }
        getComponentParents(e) {
            this.captureIds = new Map;
            const t = [];
            this.captureId(e);
            let n = e;
            for (; n = n.parent; )
                this.captureId(n),
                    t.push(n);
            return t
        }
        captureId(e) {
            if (!e)
                return null;
            const t = null != e.__VUE_DEVTOOLS_NEXT_UID__ ? e.__VUE_DEVTOOLS_NEXT_UID__ : N(e);
            return e.__VUE_DEVTOOLS_NEXT_UID__ = t,
                this.captureIds.has(t) ? null : (this.captureIds.set(t, void 0),
                    this.mark(e),
                    t)
        }
        async capture(e, t) {
            var n;
            if (!e)
                return null;
            const o = this.captureId(e)
                , r = R(e)
                , i = this.getInternalInstanceChildren(e.subTree).filter((e => !L(e)))
                , a = this.getComponentParents(e) || []
                , s = !!e.isDeactivated || a.some((e => e.isDeactivated))
                , l = {
                uid: e.uid,
                id: o,
                name: r,
                renderKey: (c = e.vnode ? e.vnode.key : null,
                    null == c ? "" : "number" == typeof c ? c : "string" == typeof c ? `'${c}'` : Array.isArray(c) ? "Array" : "Object"),
                inactive: s,
                children: [],
                isFragment: w(e),
                tags: "function" != typeof e.type ? [] : [{
                    label: "functional",
                    textColor: 5592405,
                    backgroundColor: 15658734
                }],
                autoOpen: this.recursively,
                file: e.type.__file || ""
            };
            var c;
            if ((t < this.maxDepth || e.type.__isKeepAlive || a.some((e => e.type.__isKeepAlive))) && (l.children = await Promise.all(i.map((e => this.capture(e, t + 1))).filter(Boolean))),
                this.isKeepAlive(e)) {
                const n = this.getKeepAliveCachedInstances(e)
                    , o = i.map((e => e.__VUE_DEVTOOLS_NEXT_UID__));
                for (const e of n)
                    if (!o.includes(e.__VUE_DEVTOOLS_NEXT_UID__)) {
                        const n = await this.capture({
                            ...e,
                            isDeactivated: !0
                        }, t + 1);
                        n && l.children.push(n)
                    }
            }
            const u = K(e)[0];
            if (null == u ? void 0 : u.parentElement) {
                const t = e.parent
                    , n = t ? K(t) : [];
                let o = u;
                const r = [];
                do {
                    r.push(Array.from(o.parentElement.childNodes).indexOf(o)),
                        o = o.parentElement
                } while (o.parentElement && n.length && !n.includes(o));
                l.domOrder = r.reverse()
            } else
                l.domOrder = [-1];
            return (null == (n = e.suspense) ? void 0 : n.suspenseKey) && (l.tags.push({
                label: e.suspense.suspenseKey,
                backgroundColor: 14979812,
                textColor: 16777215
            }),
                this.mark(e, !0)),
                this.api.visitComponentTree({
                    treeNode: l,
                    componentInstance: e,
                    app: e.appContext.app,
                    filter: this.componentFilter.filter
                }),
                l
        }
        async findQualifiedChildren(e, t) {
            var n;
            if (this.componentFilter.isQualified(e) && !(null == (n = e.type.devtools) ? void 0 : n.hide))
                return [await this.capture(e, t)];
            if (e.subTree) {
                const n = this.isKeepAlive(e) ? this.getKeepAliveCachedInstances(e) : this.getInternalInstanceChildren(e.subTree);
                return this.findQualifiedChildrenFromList(n, t)
            }
            return []
        }
        async findQualifiedChildrenFromList(e, t) {
            return e = e.filter((e => {
                    var t;
                    return !L(e) && !(null == (t = e.type.devtools) ? void 0 : t.hide)
                }
            )),
                this.componentFilter.filter ? Array.prototype.concat.apply([], await Promise.all(e.map((e => this.findQualifiedChildren(e, t))))) : Promise.all(e.map((e => this.capture(e, t))))
        }
        getInternalInstanceChildren(e, t=null) {
            const n = [];
            if (e)
                if (e.component)
                    t ? n.push({
                        ...e.component,
                        suspense: t
                    }) : n.push(e.component);
                else if (e.suspense) {
                    const t = e.suspense.isInFallback ? "suspense fallback" : "suspense default";
                    n.push(...this.getInternalInstanceChildren(e.suspense.activeBranch, {
                        ...e.suspense,
                        suspenseKey: t
                    }))
                } else
                    Array.isArray(e.children) && e.children.forEach((e => {
                            e.component ? t ? n.push({
                                ...e.component,
                                suspense: t
                            }) : n.push(e.component) : n.push(...this.getInternalInstanceChildren(e, t))
                        }
                    ));
            return n.filter((e => {
                    var t;
                    return !L(e) && !(null == (t = e.type.devtools) ? void 0 : t.hide)
                }
            ))
        }
        mark(e, t=!1) {
            const n = D(e).instanceMap;
            !t && n.has(e.__VUE_DEVTOOLS_NEXT_UID__) || (n.set(e.__VUE_DEVTOOLS_NEXT_UID__, e),
                Be.value.instanceMap = n)
        }
        isKeepAlive(e) {
            return e.type.__isKeepAlive && e.__v_cache
        }
        getKeepAliveCachedInstances(e) {
            return Array.from(e.__v_cache.values()).map((e => e.component)).filter(Boolean)
        }
    }
;
I(),
    I();
var Gt = new Map
    , Ft = "performance";
function Xt(e, t, n, o, r, i) {
    const a = D(t);
    if (!a)
        return;
    const s = R(o) || "Unknown Component"
        , l = `${n}-${r}`
        , c = a.perfGroupIds.get(l);
    if (c) {
        const t = c.groupId
            , n = i - c.time;
        e.addTimelineEvent({
            layerId: Ft,
            event: {
                time: Date.now(),
                data: {
                    component: s,
                    type: r,
                    measure: "end",
                    duration: {
                        _custom: {
                            type: "Duration",
                            value: n,
                            display: `${n} ms`
                        }
                    }
                },
                title: s,
                subtitle: r,
                groupId: t
            }
        })
    } else
        Gt.set(l, {
            app: t,
            uid: n,
            instance: o,
            type: r,
            time: i
        })
}
var Yt = "component-event";
function qt(e) {
    n && (e.addTimelineLayer({
        id: "mouse",
        label: "Mouse",
        color: 10768815
    }),
        ["mousedown", "mouseup", "click", "dblclick"].forEach((t => {
                Ye.timelineLayersState.recordingState && Ye.timelineLayersState.mouseEventEnabled && window.addEventListener(t, (async n => {
                        await e.addTimelineEvent({
                            layerId: "mouse",
                            event: {
                                time: Date.now(),
                                data: {
                                    type: t,
                                    x: n.clientX,
                                    y: n.clientY
                                },
                                title: t
                            }
                        })
                    }
                ), {
                    capture: !0,
                    passive: !0
                })
            }
        )),
        e.addTimelineLayer({
            id: "keyboard",
            label: "Keyboard",
            color: 8475055
        }),
        ["keyup", "keydown", "keypress"].forEach((t => {
                window.addEventListener(t, (async n => {
                        Ye.timelineLayersState.recordingState && Ye.timelineLayersState.keyboardEventEnabled && await e.addTimelineEvent({
                            layerId: "keyboard",
                            event: {
                                time: Date.now(),
                                data: {
                                    type: t,
                                    key: n.key,
                                    ctrlKey: n.ctrlKey,
                                    shiftKey: n.shiftKey,
                                    altKey: n.altKey,
                                    metaKey: n.metaKey
                                },
                                title: n.key
                            }
                        })
                    }
                ), {
                    capture: !0,
                    passive: !0
                })
            }
        )),
        e.addTimelineLayer({
            id: Yt,
            label: "Component events",
            color: 5226637
        }),
        ht.on.componentEmit((async (t, n, o, r) => {
                if (!Ye.timelineLayersState.recordingState || !Ye.timelineLayersState.componentEventEnabled)
                    return;
                const i = await D(t);
                if (!i)
                    return;
                const a = `${i.id}:${n.uid}`
                    , s = R(n) || "Unknown Component";
                e.addTimelineEvent({
                    layerId: Yt,
                    event: {
                        time: Date.now(),
                        data: {
                            component: {
                                _custom: {
                                    type: "component-definition",
                                    display: s
                                }
                            },
                            event: o,
                            params: r
                        },
                        title: o,
                        subtitle: `by ${s}`,
                        meta: {
                            componentId: a
                        }
                    }
                })
            }
        )),
        e.addTimelineLayer({
            id: "performance",
            label: Ft,
            color: 4307050
        }),
        ht.on.perfStart(( (t, n, o, r, i) => {
                Ye.timelineLayersState.recordingState && Ye.timelineLayersState.performanceEventEnabled && async function(e, t, n, o, r, i) {
                    const a = await D(t);
                    if (!a)
                        return;
                    const s = R(o) || "Unknown Component"
                        , l = Ye.perfUniqueGroupId++
                        , c = `${n}-${r}`;
                    if (a.perfGroupIds.set(c, {
                        groupId: l,
                        time: i
                    }),
                        await e.addTimelineEvent({
                            layerId: Ft,
                            event: {
                                time: Date.now(),
                                data: {
                                    component: s,
                                    type: r,
                                    measure: "start"
                                },
                                title: s,
                                subtitle: r,
                                groupId: l
                            }
                        }),
                        Gt.has(c)) {
                        const {app: t, uid: n, instance: o, type: r, time: i} = Gt.get(c);
                        Gt.delete(c),
                            await Xt(e, t, n, o, r, i)
                    }
                }(e, t, n, o, r, i)
            }
        )),
        ht.on.perfEnd(( (t, n, o, r, i) => {
                Ye.timelineLayersState.recordingState && Ye.timelineLayersState.performanceEventEnabled && Xt(e, t, n, o, r, i)
            }
        )))
}
I();
var Wt = [];
var Zt, Jt = "components";
function Qt(e) {
    return [{
        id: Jt,
        label: "Components",
        app: e
    }, t => {
        t.addInspector({
            id: Jt,
            label: "Components",
            treeFilterPlaceholder: "Search components"
        }),
            qt(t),
            t.on.getInspectorTree((async n => {
                    if (n.app === e && n.inspectorId === Jt) {
                        const e = A(Be.value, n.instanceId);
                        if (e) {
                            const o = new Bt({
                                filterText: n.filter,
                                maxDepth: 100,
                                recursively: !1,
                                api: t
                            });
                            n.rootNodes = await o.getComponentTree(e)
                        }
                    }
                }
            )),
            t.on.getInspectorState((async t => {
                    var n;
                    if (t.app === e && t.inspectorId === Jt) {
                        const e = function(e) {
                            var t;
                            const n = A(Be.value, e.instanceId);
                            return {
                                id: N(n),
                                name: R(n),
                                file: null == (t = null == n ? void 0 : n.type) ? void 0 : t.__file,
                                state: Ht(n),
                                instance: n
                            }
                        }({
                            instanceId: t.nodeId
                        })
                            , o = e.instance
                            , r = {
                            componentInstance: o,
                            app: null == (n = e.instance) ? void 0 : n.appContext.app,
                            instanceData: e
                        };
                        yn.hooks.callHookWith((e => {
                                e.forEach((e => e(r)))
                            }
                        ), "inspectComponent"),
                            t.state = e,
                            function(e) {
                                if ("undefined" == typeof window)
                                    return;
                                const t = window;
                                if (e && (t.$vm = e,
                                Wt[0] !== e)) {
                                    Wt.length >= 10 && Wt.pop();
                                    for (let e = Wt.length; e > 0; e--)
                                        t[`$vm${e}`] = Wt[e] = Wt[e - 1];
                                    t.$vm0 = Wt[0] = e
                                }
                            }(o)
                    }
                }
            )),
            t.on.editInspectorState((async n => {
                    n.app === e && n.inspectorId === Jt && (de(n),
                        await t.sendInspectorState("components"))
                }
            ));
        const n = c(( () => {
                t.sendInspectorTree(Jt)
            }
        ), 120)
            , o = c(( () => {
                t.sendInspectorState(Jt)
            }
        ), 120);
        ht.on.componentAdded((async (e, t, o, r) => {
                var i, a, s;
                if (Ye.highPerfModeEnabled)
                    return;
                if (null == (s = null == (a = null == (i = null == e ? void 0 : e._instance) ? void 0 : i.type) ? void 0 : a.devtools) ? void 0 : s.hide)
                    return;
                if (!e || "number" != typeof t && !t || !r)
                    return;
                const l = await C({
                    app: e,
                    uid: t,
                    instance: r
                })
                    , c = await D(e);
                r && (null == r.__VUE_DEVTOOLS_NEXT_UID__ && (r.__VUE_DEVTOOLS_NEXT_UID__ = l),
                (null == c ? void 0 : c.instanceMap.has(l)) || (null == c || c.instanceMap.set(l, r),
                Be.value.id === (null == c ? void 0 : c.id) && (Be.value.instanceMap = c.instanceMap))),
                c && n()
            }
        )),
            ht.on.componentUpdated((async (e, t, r, i) => {
                    var a, s, l;
                    if (Ye.highPerfModeEnabled)
                        return;
                    if (null == (l = null == (s = null == (a = null == e ? void 0 : e._instance) ? void 0 : a.type) ? void 0 : s.devtools) ? void 0 : l.hide)
                        return;
                    if (!e || "number" != typeof t && !t || !i)
                        return;
                    const c = await C({
                        app: e,
                        uid: t,
                        instance: i
                    })
                        , u = await D(e);
                    i && (null == i.__VUE_DEVTOOLS_NEXT_UID__ && (i.__VUE_DEVTOOLS_NEXT_UID__ = c),
                    (null == u ? void 0 : u.instanceMap.has(c)) || (null == u || u.instanceMap.set(c, i),
                    Be.value.id === (null == u ? void 0 : u.id) && (Be.value.instanceMap = u.instanceMap))),
                    u && (n(),
                        o())
                }
            )),
            ht.on.componentRemoved((async (e, t, o, r) => {
                    var i, a, s;
                    if (Ye.highPerfModeEnabled)
                        return;
                    if (null == (s = null == (a = null == (i = null == e ? void 0 : e._instance) ? void 0 : i.type) ? void 0 : a.devtools) ? void 0 : s.hide)
                        return;
                    if (!e || "number" != typeof t && !t || !r)
                        return;
                    const l = await D(e);
                    if (!l)
                        return;
                    const c = await C({
                        app: e,
                        uid: t,
                        instance: r
                    });
                    null == l || l.instanceMap.delete(c),
                    Be.value.id === (null == l ? void 0 : l.id) && (Be.value.instanceMap = l.instanceMap),
                        n()
                }
            ))
    }
    ]
}
function en(e, t) {
    return ht.setupDevToolsPlugin(e, t)
}
function tn(e, t) {
    const [n,o] = e;
    if (n.app !== t)
        return;
    const r = new vt({
        plugin: {
            setupFn: o,
            descriptor: n
        },
        ctx: yn
    });
    "vuex" === n.packageName && r.on.editInspectorState((e => {
            r.sendInspectorState(e.inspectorId)
        }
    )),
        o(r)
}
function nn(t) {
    e.__VUE_DEVTOOLS_KIT__REGISTERED_PLUGIN_APPS__.delete(t)
}
function on(t, n) {
    e.__VUE_DEVTOOLS_KIT__REGISTERED_PLUGIN_APPS__.has(t) || Ye.highPerfModeEnabled && !(null == n ? void 0 : n.inspectingComponent) || (e.__VUE_DEVTOOLS_KIT__REGISTERED_PLUGIN_APPS__.add(t),
        lt.forEach((e => {
                tn(e, t)
            }
        )))
}
null != (Zt = e).__VUE_DEVTOOLS_KIT__REGISTERED_PLUGIN_APPS__ || (Zt.__VUE_DEVTOOLS_KIT__REGISTERED_PLUGIN_APPS__ = new Set),
    I(),
    I();
var rn, an, sn = "__VUE_DEVTOOLS_ROUTER__", ln = "__VUE_DEVTOOLS_ROUTER_INFO__";
null != (rn = e)[ln] || (rn[ln] = {
    currentRoute: null,
    routes: []
}),
null != (an = e)[sn] || (an[sn] = {});
var cn, un = new Proxy(e[ln],{
    get: (t, n) => e[ln][n]
}), pn = new Proxy(e[sn],{
    get(t, n) {
        if ("value" === n)
            return e[sn]
    }
});
function dn(e) {
    return e.map((e => {
            let {path: t, name: n, children: o, meta: r} = e;
            return (null == o ? void 0 : o.length) && (o = dn(o)),
                {
                    path: t,
                    name: n,
                    children: o,
                    meta: r
                }
        }
    ))
}
function _n(t, n) {
    function o() {
        var n;
        const o = null == (n = t.app) ? void 0 : n.config.globalProperties.$router
            , r = function(e) {
            if (e) {
                const {fullPath: t, hash: n, href: o, path: r, name: i, matched: a, params: s, query: l} = e;
                return {
                    fullPath: t,
                    hash: n,
                    href: o,
                    path: r,
                    name: i,
                    params: s,
                    query: l,
                    matched: dn(a)
                }
            }
            return e
        }(null == o ? void 0 : o.currentRoute.value)
            , i = dn(function(e) {
            const t = new Map;
            return ((null == e ? void 0 : e.getRoutes()) || []).filter((e => !t.has(e.path) && t.set(e.path, 1)))
        }(o))
            , s = console.warn;
        console.warn = () => {}
            ,
            e[ln] = {
                currentRoute: r ? a(r) : {},
                routes: a(i)
            },
            e[sn] = o,
            console.warn = s
    }
    o(),
        ht.on.componentUpdated(c(( () => {
                var r;
                (null == (r = n.value) ? void 0 : r.app) === t.app && (o(),
                Ye.highPerfModeEnabled || yn.hooks.callHook("routerInfoUpdated", {
                    state: e[ln]
                }))
            }
        ), 200))
}
function fn(t) {
    return {
        async getInspectorTree(e) {
            const n = {
                ...e,
                app: Be.value.app,
                rootNodes: []
            };
            return await new Promise((e => {
                    t.callHookWith((async t => {
                            await Promise.all(t.map((e => e(n)))),
                                e()
                        }
                    ), "getInspectorTree")
                }
            )),
                n.rootNodes
        },
        async getInspectorState(e) {
            const n = {
                ...e,
                app: Be.value.app,
                state: null
            }
                , o = {
                currentTab: `custom-inspector:${e.inspectorId}`
            };
            return await new Promise((e => {
                    t.callHookWith((async t => {
                            await Promise.all(t.map((e => e(n, o)))),
                                e()
                        }
                    ), "getInspectorState")
                }
            )),
                n.state
        },
        editInspectorState(e) {
            const n = new ce
                , o = {
                ...e,
                app: Be.value.app,
                set: (t, o=e.path, r=e.state.value, i) => {
                    n.set(t, o, r, i || n.createDefaultSetCallback(e.state))
                }
            };
            t.callHookWith((e => {
                    e.forEach((e => e(o)))
                }
            ), "editInspectorState")
        },
        sendInspectorState(e) {
            const n = Se(e);
            t.callHook("sendInspectorState", {
                inspectorId: e,
                plugin: {
                    descriptor: n.descriptor,
                    setupFn: () => ({})
                }
            })
        },
        inspectComponentInspector: () => oe(),
        cancelInspectComponentInspector: () => (J(),
            window.removeEventListener("mouseover", ee),
            window.removeEventListener("click", ne, !0),
            void (ne = null)),
        getComponentRenderCode(e) {
            const t = A(Be.value, e);
            if (t)
                return "function" != typeof (null == t ? void 0 : t.type) ? t.render.toString() : t.type.toString()
        },
        scrollToComponent: e => function(e) {
            const t = A(Be.value, e.id);
            if (t) {
                const [n] = K(t);
                if ("function" == typeof n.scrollIntoView)
                    n.scrollIntoView({
                        behavior: "smooth"
                    });
                else {
                    const e = j(t)
                        , n = document.createElement("div")
                        , o = {
                        ...q(e),
                        position: "absolute"
                    };
                    Object.assign(n.style, o),
                        document.body.appendChild(n),
                        n.scrollIntoView({
                            behavior: "smooth"
                        }),
                        setTimeout(( () => {
                                document.body.removeChild(n)
                            }
                        ), 2e3)
                }
                setTimeout(( () => {
                        const n = j(t);
                        if (n.width || n.height) {
                            const o = R(t)
                                , r = Y();
                            r ? Z({
                                ...e,
                                name: o,
                                bounds: n
                            }) : W({
                                ...e,
                                name: o,
                                bounds: n
                            }),
                                setTimeout(( () => {
                                        r && (r.style.display = "none")
                                    }
                                ), 1500)
                        }
                    }
                ), 1200)
            }
        }({
            id: e
        }),
        openInEditor: it,
        getVueInspector: ie,
        toggleApp(e, t) {
            const n = $e.value.find((t => t.id === e));
            n && (Xe(e),
                Fe(n),
                _n(n, Be),
                ge(),
                on(n.app, t))
        },
        inspectDOM(t) {
            const n = A(Be.value, t);
            if (n) {
                const [t] = K(n);
                t && (e.__VUE_DEVTOOLS_INSPECT_DOM_TARGET__ = t)
            }
        },
        updatePluginSettings(e, t, n) {
            !function(e, t, n) {
                const o = pt(e)
                    , r = localStorage.getItem(o)
                    , i = JSON.parse(r || "{}")
                    , a = {
                    ...i,
                    [t]: n
                };
                localStorage.setItem(o, JSON.stringify(a)),
                    yn.hooks.callHookWith((o => {
                            o.forEach((o => o({
                                pluginId: e,
                                key: t,
                                oldValue: i[t],
                                newValue: n,
                                settings: a
                            })))
                        }
                    ), "setPluginSettings")
            }(e, t, n)
        },
        getPluginSettings: e => ({
            options: dt(e),
            values: _t(e)
        })
    }
}
function mn() {
    return e.__VUE_DEVTOOLS_ENV__
}
function En(t) {
    e.__VUE_DEVTOOLS_ENV__ = {
        ...e.__VUE_DEVTOOLS_ENV__,
        ...t
    }
}
I(),
null != (cn = e).__VUE_DEVTOOLS_ENV__ || (cn.__VUE_DEVTOOLS_ENV__ = {
    vitePluginDetected: !1
});
var hn, vn = Ae();
null != (hn = e).__VUE_DEVTOOLS_KIT_CONTEXT__ || (hn.__VUE_DEVTOOLS_KIT_CONTEXT__ = {
    hooks: vn,
    get state() {
        return {
            ...Ye,
            activeAppRecordId: Be.id,
            activeAppRecord: Be.value,
            appRecords: $e.value
        }
    },
    api: fn(vn)
});
var yn = e.__VUE_DEVTOOLS_KIT_CONTEXT__;
I();
var gn, On, Tn, In, Sn, bn, Vn = (gn = b(),
    On = 1,
    Tn = null != gn ? E(g(gn)) : {},
    ( (e, t, n, o) => {
            if (t && "object" == typeof t || "function" == typeof t)
                for (let r of y(t))
                    O.call(e, r) || r === n || h(e, r, {
                        get: () => t[r],
                        enumerable: !(o = v(t, r)) || o.enumerable
                    });
            return e
        }
    )(!On && gn && gn.__esModule ? Tn : h(Tn, "default", {
        value: gn,
        enumerable: !0
    }), gn)), kn = null != (Sn = (In = e).__VUE_DEVTOOLS_NEXT_APP_RECORD_INFO__) ? Sn : In.__VUE_DEVTOOLS_NEXT_APP_RECORD_INFO__ = {
    id: 0,
    appIds: new Set
};
function Dn(e, t) {
    const n = function(e) {
        var t, n, o, r;
        return e._instance ? e._instance : (null == (n = null == (t = e._container) ? void 0 : t._vnode) ? void 0 : n.component) ? null == (r = null == (o = e._container) ? void 0 : o._vnode) ? void 0 : r.component : void 0
    }(e);
    if (n) {
        kn.id++;
        const o = function(e, t) {
            var n;
            return (null == (n = null == e ? void 0 : e._component) ? void 0 : n.name) || `App ${t}`
        }(e, kn.id.toString())
            , r = function(e, t) {
            if (null != e.__VUE_DEVTOOLS_NEXT_APP_RECORD_ID__)
                return e.__VUE_DEVTOOLS_NEXT_APP_RECORD_ID__;
            let n = null != t ? t : (kn.id++).toString();
            if (t && kn.appIds.has(n)) {
                let e = 1;
                for (; kn.appIds.has(`${t}_${e}`); )
                    e++;
                n = `${t}_${e}`
            }
            return kn.appIds.add(n),
                e.__VUE_DEVTOOLS_NEXT_APP_RECORD_ID__ = n,
                n
        }(e, (0,
            Vn.default)(o))
            , i = {
            id: r,
            name: o,
            types: t,
            instanceMap: new Map,
            perfGroupIds: new Map,
            rootInstance: n
        };
        e.__VUE_DEVTOOLS_NEXT_APP_RECORD__ = i;
        const a = `${i.id}:root`;
        return i.instanceMap.set(a, i.rootInstance),
            i.rootInstance.__VUE_DEVTOOLS_NEXT_UID__ = a,
            i
    }
    return {}
}
function Cn() {
    var n;
    We({
        vitePluginDetected: mn().vitePluginDetected
    });
    const o = "vue-devtools-next" === (null == (n = e.__VUE_DEVTOOLS_GLOBAL_HOOK__) ? void 0 : n.id);
    if (e.__VUE_DEVTOOLS_GLOBAL_HOOK__ && o)
        return;
    const r = {
        id: "vue-devtools-next",
        devtoolsVersion: "7.0",
        enabled: !1,
        appRecords: [],
        apps: [],
        events: new Map,
        on(e, t) {
            var n;
            return this.events.has(e) || this.events.set(e, []),
            null == (n = this.events.get(e)) || n.push(t),
                () => this.off(e, t)
        },
        once(e, t) {
            const n = (...o) => {
                    this.off(e, n),
                        t(...o)
                }
            ;
            return this.on(e, n),
                [e, n]
        },
        off(e, t) {
            if (this.events.has(e)) {
                const n = this.events.get(e)
                    , o = n.indexOf(t);
                -1 !== o && n.splice(o, 1)
            }
        },
        emit(e, ...t) {
            this.events.has(e) && this.events.get(e).forEach((e => e(...t)))
        }
    };
    if (e.__VUE_DEVTOOLS_HOOK_REPLAY__)
        try {
            e.__VUE_DEVTOOLS_HOOK_REPLAY__.forEach((e => e(r))),
                e.__VUE_DEVTOOLS_HOOK_REPLAY__ = []
        } catch (e) {
            console.error("[vue-devtools] Error during hook replay", e)
        }
    var i, a;
    r.once("init", (t => {
            e.__VUE_DEVTOOLS_VUE2_APP_DETECTED__ = !0,
                console.log("%c[_____Vue DevTools v7 log_____]", "color: red; font-bold: 600; font-size: 16px;"),
                console.log("%cVue DevTools v7 detected in your Vue2 project. v7 only supports Vue3 and will not work.", "font-bold: 500; font-size: 14px;");
            console.log("%cThe legacy version that supports both Vue 2 and Vue 3 has been moved to %c https://chromewebstore.google.com/detail/vuejs-devtools/iaajmlceplecbljialhhkmedjlpdblhp", "font-size: 14px;", "text-decoration: underline; cursor: pointer;font-size: 14px;"),
                console.log("%cPlease install and enable only the legacy version for your Vue2 app.", "font-bold: 500; font-size: 14px;"),
                console.log("%c[_____Vue DevTools v7 log_____]", "color: red; font-bold: 600; font-size: 16px;")
        }
    )),
        ht.on.setupDevtoolsPlugin(( (e, t) => {
                var n;
                ct(e, t);
                const {app: o} = null != (n = Be) ? n : {};
                e.settings && ft(e.id, e.settings),
                o && tn([e, t], o)
            }
        )),
        i = () => {
            lt.filter(( ([e]) => "components" !== e.id)).forEach(( ([e,t]) => {
                    r.emit("devtools-plugin:setup", e, t, {
                        target: "legacy"
                    })
                }
            ))
        }
        ,
        e.__VUE_DEVTOOLS_PLUGIN_API_AVAILABLE__ ? i() : Object.defineProperty(e, "__VUE_DEVTOOLS_PLUGIN_API_AVAILABLE__", {
            set(e) {
                e && i()
            },
            configurable: !0
        }),
        ht.on.vueAppInit((async (e, t, n) => {
                const o = {
                    ...Dn(e, n),
                    app: e,
                    version: t
                };
                He(o),
                1 === $e.value.length && (Fe(o),
                    Xe(o.id),
                    _n(o, Be),
                    on(o.app)),
                    en(...Qt(o.app)),
                    We({
                        connected: !0
                    }),
                    r.apps.push(e)
            }
        )),
        ht.on.vueAppUnmount((async t => {
                const n = $e.value.filter((e => e.app !== t));
                0 === n.length && We({
                    connected: !1
                }),
                    ze(t),
                    function(e) {
                        const t = e.__VUE_DEVTOOLS_NEXT_APP_RECORD_ID__;
                        null != t && (kn.appIds.delete(t),
                            kn.id--)
                    }(t),
                Be.value.app === t && (Fe(n[0]),
                    yn.hooks.callHook("sendActiveAppUpdatedToClient")),
                    e.__VUE_DEVTOOLS_GLOBAL_HOOK__.apps.splice(e.__VUE_DEVTOOLS_GLOBAL_HOOK__.apps.indexOf(t), 1),
                    nn(t)
            }
        )),
        (a = r).on("app:init", ( (e, t, n) => {
                var o, r, i;
                (null == (i = null == (r = null == (o = null == e ? void 0 : e._instance) ? void 0 : o.type) ? void 0 : r.devtools) ? void 0 : i.hide) || mt.callHook("app:init", e, t, n)
            }
        )),
        a.on("app:unmount", (e => {
                mt.callHook("app:unmount", e)
            }
        )),
        a.on("component:added", (async (e, t, n, o) => {
                var r, i, a;
                (null == (a = null == (i = null == (r = null == e ? void 0 : e._instance) ? void 0 : r.type) ? void 0 : i.devtools) ? void 0 : a.hide) || Ye.highPerfModeEnabled || e && ("number" == typeof t || t) && o && mt.callHook("component:added", e, t, n, o)
            }
        )),
        a.on("component:updated", ( (e, t, n, o) => {
                e && ("number" == typeof t || t) && o && !Ye.highPerfModeEnabled && mt.callHook("component:updated", e, t, n, o)
            }
        )),
        a.on("component:removed", (async (e, t, n, o) => {
                e && ("number" == typeof t || t) && o && !Ye.highPerfModeEnabled && mt.callHook("component:removed", e, t, n, o)
            }
        )),
        a.on("component:emit", (async (e, t, n, o) => {
                e && t && !Ye.highPerfModeEnabled && mt.callHook("component:emit", e, t, n, o)
            }
        )),
        a.on("perf:start", ( (e, t, n, o, r) => {
                e && !Ye.highPerfModeEnabled && mt.callHook("perf:start", e, t, n, o, r)
            }
        )),
        a.on("perf:end", ( (e, t, n, o, r) => {
                e && !Ye.highPerfModeEnabled && mt.callHook("perf:end", e, t, n, o, r)
            }
        )),
        a.on("devtools-plugin:setup", ( (e, t, n) => {
                "legacy" !== (null == n ? void 0 : n.target) && mt.callHook("devtools-plugin:setup", e, t)
            }
        )),
        e.__VUE_DEVTOOLS_GLOBAL_HOOK__ ? t || Object.assign(__VUE_DEVTOOLS_GLOBAL_HOOK__, r) : Object.defineProperty(e, "__VUE_DEVTOOLS_GLOBAL_HOOK__", {
            get: () => r
        })
}
function wn(e) {
    return new Promise((t => {
            if (Ye.connected && Ye.clientConnected)
                return e(),
                    void t();
            yn.hooks.hook("devtoolsConnectedUpdated", ( ({state: n}) => {
                    n.connected && n.clientConnected && (e(),
                        t())
                }
            ))
        }
    ))
}
function Ln(e) {
    Ye.highPerfModeEnabled = null != e ? e : !Ye.highPerfModeEnabled,
    !e && Be.value && on(Be.value.app)
}
function Rn(t) {
    if (t !== St) {
        if (t === bt)
            return Number.POSITIVE_INFINITY;
        if (t === Vt)
            return Number.NEGATIVE_INFINITY;
        if (t === kt)
            return Number.NaN;
        if (t && t._custom) {
            const {_custom: e} = t;
            return "component" === e.type ? Be.value.instanceMap.get(e.id) : "map" === e.type ? function(e) {
                const t = new Map
                    , n = e._custom.value;
                for (let e = 0; e < n.length; e++) {
                    const {key: o, value: r} = n[e];
                    t.set(o, Rn(r))
                }
                return t
            }(t) : "set" === e.type ? function(e) {
                const t = new Set
                    , n = e._custom.value;
                for (let e = 0; e < n.length; e++) {
                    const o = n[e];
                    t.add(Rn(o))
                }
                return t
            }(t) : "bigint" === e.type ? BigInt(e.value) : Rn(e.value)
        }
        if (gt.test(t)) {
            const [,e] = gt.exec(t);
            return Symbol.for(e)
        }
        if (Tt.test(t)) {
            const [,n,o,,r] = Tt.exec(t)
                , i = new e[n](o);
            return "Error" === n && r && (i.stack = r),
                i
        }
        return t
    }
}
function Nn(e, t) {
    return Rn(t)
}
function Pn(e, t=!0) {
    const n = typeof e;
    if (null == e || e === St || "undefined" === e)
        return "null";
    if ("boolean" === n || "number" === n || e === bt || e === Vt || e === kt)
        return "literal";
    if (null == e ? void 0 : e._custom)
        return t || null != e._custom.display || null != e._custom.displayText ? "custom" : Pn(e._custom.value);
    if ("string" == typeof e) {
        const t = Tt.exec(e);
        if (t) {
            const [,e] = t;
            return `native ${e}`
        }
        return "string"
    }
    return Array.isArray(e) || (null == e ? void 0 : e._isArray) ? "array" : wt(e) ? "plain-object" : "unknown"
}
function An(e, t=!1, n) {
    var o, r, i;
    const {customClass: a} = null != n ? n : {};
    let s;
    const l = Pn(e, !1);
    if ("custom" !== l && (null == e ? void 0 : e._custom) && (e = e._custom.value),
        s = function(e) {
            return null === e ? "null" : "string" == typeof e && At[e] || !1
        }(e))
        return s;
    if ("custom" === l) {
        return (null == (o = e._custom.value) ? void 0 : o._custom) && An(e._custom.value, t, n) || e._custom.displayText || e._custom.display
    }
    if ("array" === l)
        return `Array[${e.length}]`;
    if ("plain-object" === l)
        return "Object" + (Object.keys(e).length ? "" : " (empty)");
    if (null == l ? void 0 : l.includes("native"))
        return Kt(null == (r = Tt.exec(e)) ? void 0 : r[2]);
    if ("string" == typeof e) {
        const n = e.match(Ot);
        e = n ? Un(n[1]) : t ? `<span>"</span>${(null == a ? void 0 : a.string) ? `<span class=${a.string}>${Un(e)}</span>` : Un(e)}<span>"</span>` : (null == a ? void 0 : a.string) ? `<span class="${null != (i = null == a ? void 0 : a.string) ? i : ""}">${Un(e)}</span>` : Un(e)
    }
    return e
}
function Un(e) {
    return Kt(e).replace(/ /g, "&nbsp;").replace(/\n/g, "<span>\\n</span>")
}
function xn(e) {
    var t, n, o;
    let r;
    let i = {};
    if ("custom" === Pn(e)) {
        const a = e
            , s = null == (t = a._custom) ? void 0 : t.value
            , l = null == (n = a._custom) ? void 0 : n.type
            , c = "object" == typeof s && null !== s && "_custom"in s ? xn(s) : {
            inherit: void 0,
            value: void 0,
            customType: void 0
        };
        i = c.inherit || (null == (o = a._custom) ? void 0 : o.fields) || {},
            e = c.value || s,
            r = c.customType || l
    }
    return e && e._isArray && (e = e.items),
        {
            value: e,
            inherit: i,
            customType: r
        }
}
function Mn(e, t) {
    return "bigint" === t || "date" === t ? e : function(e) {
        const t = new RegExp(`"(${Object.keys(At).join("|")})"`,"g");
        return e.replace(t, ( (e, t) => At[t]))
    }(JSON.stringify(e))
}
function jn(e, t) {
    return "bigint" === t ? BigInt(e) : "date" === t ? new Date(e) : JSON.parse(function(e) {
        const t = Ut[e.trim()];
        if (t)
            return `"${t}"`;
        const n = new RegExp(`:\\s*(${Object.keys(Ut).join("|")})`,"g");
        return e.replace(n, ( (e, t) => `:"${Ut[t]}"`))
    }(e), Nn)
}
function Kn(e) {
    Ye.devtoolsClientDetected = {
        ...Ye.devtoolsClientDetected,
        ...e
    };
    Ln(!Object.values(Ye.devtoolsClientDetected).some(Boolean))
}
I(),
    I(),
    I(),
    I(),
null != (bn = e).__VUE_DEVTOOLS_UPDATE_CLIENT_DETECTED__ || (bn.__VUE_DEVTOOLS_UPDATE_CLIENT_DETECTED__ = Kn),
    I(),
    I(),
    I(),
    I(),
    I(),
    I(),
    I();
var $n = class {
        constructor() {
            this.keyToValue = new Map,
                this.valueToKey = new Map
        }
        set(e, t) {
            this.keyToValue.set(e, t),
                this.valueToKey.set(t, e)
        }
        getByKey(e) {
            return this.keyToValue.get(e)
        }
        getByValue(e) {
            return this.valueToKey.get(e)
        }
        clear() {
            this.keyToValue.clear(),
                this.valueToKey.clear()
        }
    }
    , Hn = class {
        constructor(e) {
            this.generateIdentifier = e,
                this.kv = new $n
        }
        register(e, t) {
            this.kv.getByValue(e) || (t || (t = this.generateIdentifier(e)),
                this.kv.set(t, e))
        }
        clear() {
            this.kv.clear()
        }
        getIdentifier(e) {
            return this.kv.getByValue(e)
        }
        getValue(e) {
            return this.kv.getByKey(e)
        }
    }
    , zn = class extends Hn {
        constructor() {
            super((e => e.name)),
                this.classToAllowedProps = new Map
        }
        register(e, t) {
            "object" == typeof t ? (t.allowProps && this.classToAllowedProps.set(e, t.allowProps),
                super.register(e, t.identifier)) : super.register(e, t)
        }
        getAllowedProps(e) {
            return this.classToAllowedProps.get(e)
        }
    }
;
function Bn(e, t) {
    const n = function(e) {
        if ("values"in Object)
            return Object.values(e);
        const t = [];
        for (const n in e)
            e.hasOwnProperty(n) && t.push(e[n]);
        return t
    }(e);
    if ("find"in n)
        return n.find(t);
    const o = n;
    for (let e = 0; e < o.length; e++) {
        const n = o[e];
        if (t(n))
            return n
    }
}
function Gn(e, t) {
    Object.entries(e).forEach(( ([e,n]) => t(n, e)))
}
function Fn(e, t) {
    return -1 !== e.indexOf(t)
}
function Xn(e, t) {
    for (let n = 0; n < e.length; n++) {
        const o = e[n];
        if (t(o))
            return o
    }
}
I(),
    I();
var Yn = class {
        constructor() {
            this.transfomers = {}
        }
        register(e) {
            this.transfomers[e.name] = e
        }
        findApplicable(e) {
            return Bn(this.transfomers, (t => t.isApplicable(e)))
        }
        findByName(e) {
            return this.transfomers[e]
        }
    }
;
I(),
    I();
var qn = e => void 0 === e
    , Wn = e => "object" == typeof e && null !== e && (e !== Object.prototype && (null === Object.getPrototypeOf(e) || Object.getPrototypeOf(e) === Object.prototype))
    , Zn = e => Wn(e) && 0 === Object.keys(e).length
    , Jn = e => Array.isArray(e)
    , Qn = e => e instanceof Map
    , eo = e => e instanceof Set
    , to = e => "Symbol" === (e => Object.prototype.toString.call(e).slice(8, -1))(e)
    , no = e => "number" == typeof e && isNaN(e)
    , oo = e => (e => "boolean" == typeof e)(e) || (e => null === e)(e) || qn(e) || (e => "number" == typeof e && !isNaN(e))(e) || (e => "string" == typeof e)(e) || to(e);
I();
var ro = e => e.replace(/\./g, "\\.")
    , io = e => e.map(String).map(ro).join(".")
    , ao = e => {
        const t = [];
        let n = "";
        for (let o = 0; o < e.length; o++) {
            let r = e.charAt(o);
            if ("\\" === r && "." === e.charAt(o + 1)) {
                n += ".",
                    o++;
                continue
            }
            "." === r ? (t.push(n),
                n = "") : n += r
        }
        const o = n;
        return t.push(o),
            t
    }
;
function so(e, t, n, o) {
    return {
        isApplicable: e,
        annotation: t,
        transform: n,
        untransform: o
    }
}
I();
var lo = [so(qn, "undefined", ( () => null), ( () => {}
)), so((e => "bigint" == typeof e), "bigint", (e => e.toString()), (e => "undefined" != typeof BigInt ? BigInt(e) : (console.error("Please add a BigInt polyfill."),
    e))), so((e => e instanceof Date && !isNaN(e.valueOf())), "Date", (e => e.toISOString()), (e => new Date(e))), so((e => e instanceof Error), "Error", ( (e, t) => {
        const n = {
            name: e.name,
            message: e.message
        };
        return t.allowedErrorProps.forEach((t => {
                n[t] = e[t]
            }
        )),
            n
    }
), ( (e, t) => {
        const n = new Error(e.message);
        return n.name = e.name,
            n.stack = e.stack,
            t.allowedErrorProps.forEach((t => {
                    n[t] = e[t]
                }
            )),
            n
    }
)), so((e => e instanceof RegExp), "regexp", (e => "" + e), (e => {
        const t = e.slice(1, e.lastIndexOf("/"))
            , n = e.slice(e.lastIndexOf("/") + 1);
        return new RegExp(t,n)
    }
)), so(eo, "set", (e => [...e.values()]), (e => new Set(e))), so(Qn, "map", (e => [...e.entries()]), (e => new Map(e))), so((e => {
        return no(e) || ((t = e) === 1 / 0 || t === -1 / 0);
        var t
    }
), "number", (e => no(e) ? "NaN" : e > 0 ? "Infinity" : "-Infinity"), Number), so((e => 0 === e && 1 / e == -1 / 0), "number", ( () => "-0"), Number), so((e => e instanceof URL), "URL", (e => e.toString()), (e => new URL(e)))];
function co(e, t, n, o) {
    return {
        isApplicable: e,
        annotation: t,
        transform: n,
        untransform: o
    }
}
var uo = co(( (e, t) => {
        if (to(e)) {
            return !!t.symbolRegistry.getIdentifier(e)
        }
        return !1
    }
), ( (e, t) => ["symbol", t.symbolRegistry.getIdentifier(e)]), (e => e.description), ( (e, t, n) => {
        const o = n.symbolRegistry.getValue(t[1]);
        if (!o)
            throw new Error("Trying to deserialize unknown symbol");
        return o
    }
))
    , po = [Int8Array, Uint8Array, Int16Array, Uint16Array, Int32Array, Uint32Array, Float32Array, Float64Array, Uint8ClampedArray].reduce(( (e, t) => (e[t.name] = t,
    e)), {})
    , _o = co((e => ArrayBuffer.isView(e) && !(e instanceof DataView)), (e => ["typed-array", e.constructor.name]), (e => [...e]), ( (e, t) => {
        const n = po[t[1]];
        if (!n)
            throw new Error("Trying to deserialize unknown typed array");
        return new n(e)
    }
));
function fo(e, t) {
    if (null == e ? void 0 : e.constructor) {
        return !!t.classRegistry.getIdentifier(e.constructor)
    }
    return !1
}
var mo = co(fo, ( (e, t) => ["class", t.classRegistry.getIdentifier(e.constructor)]), ( (e, t) => {
        const n = t.classRegistry.getAllowedProps(e.constructor);
        if (!n)
            return {
                ...e
            };
        const o = {};
        return n.forEach((t => {
                o[t] = e[t]
            }
        )),
            o
    }
), ( (e, t, n) => {
        const o = n.classRegistry.getValue(t[1]);
        if (!o)
            throw new Error(`Trying to deserialize unknown class '${t[1]}' - check https://github.com/blitz-js/superjson/issues/116#issuecomment-773996564`);
        return Object.assign(Object.create(o.prototype), e)
    }
))
    , Eo = co(( (e, t) => !!t.customTransformerRegistry.findApplicable(e)), ( (e, t) => ["custom", t.customTransformerRegistry.findApplicable(e).name]), ( (e, t) => t.customTransformerRegistry.findApplicable(e).serialize(e)), ( (e, t, n) => {
        const o = n.customTransformerRegistry.findByName(t[1]);
        if (!o)
            throw new Error("Trying to deserialize unknown custom value");
        return o.deserialize(e)
    }
))
    , ho = [mo, uo, Eo, _o]
    , vo = (e, t) => {
    const n = Xn(ho, (n => n.isApplicable(e, t)));
    if (n)
        return {
            value: n.transform(e, t),
            type: n.annotation(e, t)
        };
    const o = Xn(lo, (n => n.isApplicable(e, t)));
    return o ? {
        value: o.transform(e, t),
        type: o.annotation
    } : void 0
}
    , yo = {};
lo.forEach((e => {
        yo[e.annotation] = e
    }
));
I();
var go = (e, t) => {
        if (t > e.size)
            throw new Error("index out of bounds");
        const n = e.keys();
        for (; t > 0; )
            n.next(),
                t--;
        return n.next().value
    }
;
function Oo(e) {
    if (Fn(e, "__proto__"))
        throw new Error("__proto__ is not allowed as a property");
    if (Fn(e, "prototype"))
        throw new Error("prototype is not allowed as a property");
    if (Fn(e, "constructor"))
        throw new Error("constructor is not allowed as a property")
}
var To = (e, t, n) => {
        if (Oo(t),
        0 === t.length)
            return n(e);
        let o = e;
        for (let e = 0; e < t.length - 1; e++) {
            const n = t[e];
            if (Jn(o)) {
                o = o[+n]
            } else if (Wn(o))
                o = o[n];
            else if (eo(o)) {
                o = go(o, +n)
            } else if (Qn(o)) {
                if (e === t.length - 2)
                    break;
                const r = +n
                    , i = 0 == +t[++e] ? "key" : "value"
                    , a = go(o, r);
                switch (i) {
                    case "key":
                        o = a;
                        break;
                    case "value":
                        o = o.get(a)
                }
            }
        }
        const r = t[t.length - 1];
        if (Jn(o) ? o[+r] = n(o[+r]) : Wn(o) && (o[r] = n(o[r])),
            eo(o)) {
            const e = go(o, +r)
                , t = n(e);
            e !== t && (o.delete(e),
                o.add(t))
        }
        if (Qn(o)) {
            const e = +t[t.length - 2]
                , i = go(o, e);
            switch (0 == +r ? "key" : "value") {
                case "key":
                {
                    const e = n(i);
                    o.set(e, o.get(i)),
                    e !== i && o.delete(i);
                    break
                }
                case "value":
                    o.set(i, n(o.get(i)))
            }
        }
        return e
    }
;
function Io(e, t, n=[]) {
    if (!e)
        return;
    if (!Jn(e))
        return void Gn(e, ( (e, o) => Io(e, t, [...n, ...ao(o)])));
    const [o,r] = e;
    r && Gn(r, ( (e, o) => {
            Io(e, t, [...n, ...ao(o)])
        }
    )),
        t(o, n)
}
function So(e, t, n) {
    return Io(t, ( (t, o) => {
            e = To(e, o, (e => ( (e, t, n) => {
                    if (!Jn(t)) {
                        const o = yo[t];
                        if (!o)
                            throw new Error("Unknown transformation: " + t);
                        return o.untransform(e, n)
                    }
                    switch (t[0]) {
                        case "symbol":
                            return uo.untransform(e, t, n);
                        case "class":
                            return mo.untransform(e, t, n);
                        case "custom":
                            return Eo.untransform(e, t, n);
                        case "typed-array":
                            return _o.untransform(e, t, n);
                        default:
                            throw new Error("Unknown transformation: " + t)
                    }
                }
            )(e, t, n)))
        }
    )),
        e
}
function bo(e, t) {
    function n(t, n) {
        const o = ( (e, t) => {
                Oo(t);
                for (let n = 0; n < t.length; n++) {
                    const o = t[n];
                    if (eo(e))
                        e = go(e, +o);
                    else if (Qn(e)) {
                        const r = +o
                            , i = 0 == +t[++n] ? "key" : "value"
                            , a = go(e, r);
                        switch (i) {
                            case "key":
                                e = a;
                                break;
                            case "value":
                                e = e.get(a)
                        }
                    } else
                        e = e[o]
                }
                return e
            }
        )(e, ao(n));
        t.map(ao).forEach((t => {
                e = To(e, t, ( () => o))
            }
        ))
    }
    if (Jn(t)) {
        const [o,r] = t;
        o.forEach((t => {
                e = To(e, ao(t), ( () => e))
            }
        )),
        r && Gn(r, n)
    } else
        Gn(t, n);
    return e
}
var Vo = (e, t, n, o, r=[], i=[], a=new Map) => {
        var s;
        const l = oo(e);
        if (!l) {
            !function(e, t, n) {
                const o = n.get(e);
                o ? o.push(t) : n.set(e, [t])
            }(e, r, t);
            const n = a.get(e);
            if (n)
                return o ? {
                    transformedValue: null
                } : n
        }
        if (!( (e, t) => Wn(e) || Jn(e) || Qn(e) || eo(e) || fo(e, t))(e, n)) {
            const t = vo(e, n)
                , o = t ? {
                transformedValue: t.value,
                annotations: [t.type]
            } : {
                transformedValue: e
            };
            return l || a.set(e, o),
                o
        }
        if (Fn(i, e))
            return {
                transformedValue: null
            };
        const c = vo(e, n)
            , u = null != (s = null == c ? void 0 : c.value) ? s : e
            , p = Jn(u) ? [] : {}
            , d = {};
        Gn(u, ( (s, l) => {
                if ("__proto__" === l || "constructor" === l || "prototype" === l)
                    throw new Error(`Detected property ${l}. This is a prototype pollution risk, please remove it from your object.`);
                const c = Vo(s, t, n, o, [...r, l], [...i, e], a);
                p[l] = c.transformedValue,
                    Jn(c.annotations) ? d[l] = c.annotations : Wn(c.annotations) && Gn(c.annotations, ( (e, t) => {
                            d[ro(l) + "." + t] = e
                        }
                    ))
            }
        ));
        const _ = Zn(d) ? {
            transformedValue: p,
            annotations: c ? [c.type] : void 0
        } : {
            transformedValue: p,
            annotations: c ? [c.type, d] : d
        };
        return l || a.set(e, _),
            _
    }
;
function ko(e) {
    return Object.prototype.toString.call(e).slice(8, -1)
}
function Do(e) {
    return "Array" === ko(e)
}
function Co(e, t={}) {
    if (Do(e))
        return e.map((e => Co(e, t)));
    if (!function(e) {
        if ("Object" !== ko(e))
            return !1;
        const t = Object.getPrototypeOf(e);
        return !!t && t.constructor === Object && t === Object.prototype
    }(e))
        return e;
    return [...Object.getOwnPropertyNames(e), ...Object.getOwnPropertySymbols(e)].reduce(( (n, o) => {
            if (Do(t.props) && !t.props.includes(o))
                return n;
            return function(e, t, n, o, r) {
                const i = {}.propertyIsEnumerable.call(o, t) ? "enumerable" : "nonenumerable";
                "enumerable" === i && (e[t] = n),
                r && "nonenumerable" === i && Object.defineProperty(e, t, {
                    value: n,
                    enumerable: !1,
                    writable: !0,
                    configurable: !0
                })
            }(n, o, Co(e[o], t), e, t.nonenumerable),
                n
        }
    ), {})
}
I(),
    I();
var wo = class {
        constructor({dedupe: e=!1}={}) {
            this.classRegistry = new zn,
                this.symbolRegistry = new Hn((e => {
                        var t;
                        return null != (t = e.description) ? t : ""
                    }
                )),
                this.customTransformerRegistry = new Yn,
                this.allowedErrorProps = [],
                this.dedupe = e
        }
        serialize(e) {
            const t = new Map
                , n = Vo(e, t, this, this.dedupe)
                , o = {
                json: n.transformedValue
            };
            n.annotations && (o.meta = {
                ...o.meta,
                values: n.annotations
            });
            const r = function(e, t) {
                const n = {};
                let o;
                return e.forEach((e => {
                        if (e.length <= 1)
                            return;
                        t || (e = e.map((e => e.map(String))).sort(( (e, t) => e.length - t.length)));
                        const [r,...i] = e;
                        0 === r.length ? o = i.map(io) : n[io(r)] = i.map(io)
                    }
                )),
                    o ? Zn(n) ? [o] : [o, n] : Zn(n) ? void 0 : n
            }(t, this.dedupe);
            return r && (o.meta = {
                ...o.meta,
                referentialEqualities: r
            }),
                o
        }
        deserialize(e) {
            const {json: t, meta: n} = e;
            let o = Co(t);
            return (null == n ? void 0 : n.values) && (o = So(o, n.values, this)),
            (null == n ? void 0 : n.referentialEqualities) && (o = bo(o, n.referentialEqualities)),
                o
        }
        stringify(e) {
            return JSON.stringify(this.serialize(e))
        }
        parse(e) {
            return this.deserialize(JSON.parse(e))
        }
        registerClass(e, t) {
            this.classRegistry.register(e, t)
        }
        registerSymbol(e, t) {
            this.symbolRegistry.register(e, t)
        }
        registerCustom(e, t) {
            this.customTransformerRegistry.register({
                name: t,
                ...e
            })
        }
        allowErrorProps(...e) {
            this.allowedErrorProps.push(...e)
        }
    }
;
wo.defaultInstance = new wo,
    wo.serialize = wo.defaultInstance.serialize.bind(wo.defaultInstance),
    wo.deserialize = wo.defaultInstance.deserialize.bind(wo.defaultInstance),
    wo.stringify = wo.defaultInstance.stringify.bind(wo.defaultInstance),
    wo.parse = wo.defaultInstance.parse.bind(wo.defaultInstance),
    wo.registerClass = wo.defaultInstance.registerClass.bind(wo.defaultInstance),
    wo.registerSymbol = wo.defaultInstance.registerSymbol.bind(wo.defaultInstance),
    wo.registerCustom = wo.defaultInstance.registerCustom.bind(wo.defaultInstance),
    wo.allowErrorProps = wo.defaultInstance.allowErrorProps.bind(wo.defaultInstance),
    wo.serialize,
    wo.deserialize,
    wo.stringify,
    wo.parse,
    wo.registerClass,
    wo.registerCustom,
    wo.registerSymbol,
    wo.allowErrorProps,
    I();
var Lo = "__devtools-kit-broadcast-messaging-event-key__";
function Ro() {
    const e = new BroadcastChannel("__devtools-kit:broadcast-channel__");
    return {
        post: t => {
            e.postMessage(wo.stringify({
                event: Lo,
                data: t
            }))
        }
        ,
        on: t => {
            e.onmessage = e => {
                const n = wo.parse(e.data);
                n.event === Lo && t(n.data)
            }
        }
    }
}
I(),
    I(),
    I();
var No = "electron:client-context"
    , Po = "electron:proxy-context"
    , Ao = "electron:server-context"
    , Uo = "client->proxy"
    , xo = "proxy->client"
    , Mo = "proxy->server"
    , jo = "server->proxy";
function Ko(t) {
    e[No] = t
}
function $o(t) {
    e[Po] = t
}
function Ho(t) {
    e[Ao] = t
}
function zo() {
    const t = e[No];
    return {
        post: e => {
            t.emit(Uo, wo.stringify(e))
        }
        ,
        on: e => {
            t.on(xo, (t => {
                    e(wo.parse(t))
                }
            ))
        }
    }
}
function Bo() {
    const t = e[Po];
    return {
        post: e => {}
        ,
        on: e => {
            t.on(jo, (e => {
                    t.broadcast.emit(xo, e)
                }
            )),
                t.on(Uo, (e => {
                        t.broadcast.emit(Mo, e)
                    }
                ))
        }
    }
}
function Go() {
    const t = e[Ao];
    return {
        post: e => {
            t.emit(jo, wo.stringify(e))
        }
        ,
        on: e => {
            t.on(Mo, (t => {
                    e(wo.parse(t))
                }
            ))
        }
    }
}
I(),
    I(),
    I(),
    I(),
    I();
var Fo = "electron:client-context"
    , Xo = "proxy->server"
    , Yo = "server->proxy";
function qo() {
    return e[Fo]
}
function Wo(t) {
    e[Fo] = t
}
function Zo() {
    let e = !1
        , t = null
        , n = null
        , o = null;
    return function r() {
        try {
            clearTimeout(n),
                t = chrome.runtime.connect({
                    name: `${chrome.devtools.inspectedWindow.tabId}`
                }),
                Wo(t),
                e = !1,
            null == t || t.onMessage.addListener(o),
                t.onDisconnect.addListener(( () => {
                        e = !0,
                        null == t || t.onMessage.removeListener(o),
                            n = setTimeout(r, 1e3)
                    }
                ))
        } catch (t) {
            e = !0
        }
    }(),
        {
            post: n => {
                e || null == t || t.postMessage(wo.stringify(n))
            }
            ,
            on: n => {
                o = t => {
                    e || n(wo.parse(t))
                }
                    ,
                null == t || t.onMessage.addListener(o)
            }
        }
}
function Jo() {
    const e = chrome.runtime.connect({
        name: "content-script"
    });
    function t(e) {
        window.postMessage({
            source: Xo,
            payload: e
        }, "*")
    }
    function n(t) {
        if (t.data && t.data.source === Yo)
            try {
                e.postMessage(t.data.payload)
            } catch (e) {}
    }
    return e.onMessage.addListener(t),
        window.addEventListener("message", n),
        e.onDisconnect.addListener(( () => {
                window.removeEventListener("message", n),
                    t(wo.stringify({
                        event: "shutdown"
                    }))
            }
        )),
        t(wo.stringify({
            event: "init"
        })),
        {
            post: e => {}
            ,
            on: e => {}
        }
}
function Qo() {
    return {
        post: e => {
            window.postMessage({
                source: Yo,
                payload: wo.stringify(e)
            }, "*")
        }
        ,
        on: e => {
            const t = t => {
                    t.data.source === Xo && t.data.payload && e(wo.parse(t.data.payload))
                }
            ;
            return window.addEventListener("message", t),
                () => {
                    window.removeEventListener("message", t)
                }
        }
    }
}
I(),
    I(),
    I(),
    I(),
    I();
var er = "__devtools-kit-iframe-messaging-event-key__"
    , tr = "iframe:server-context";
function nr() {
    return e[tr]
}
function or(t) {
    e[tr] = t
}
function rr() {
    return n ? {
        post: e => window.parent.postMessage(wo.stringify({
            event: er,
            data: e
        }), "*"),
        on: e => window.addEventListener("message", (t => {
                try {
                    const n = wo.parse(t.data);
                    t.source === window.parent && n.event === er && e(n.data)
                } catch (e) {}
            }
        ))
    } : {
        post: e => {}
        ,
        on: e => {}
    }
}
function ir() {
    return n ? {
        post: e => {
            var t;
            const n = nr();
            null == (t = null == n ? void 0 : n.contentWindow) || t.postMessage(wo.stringify({
                event: er,
                data: e
            }), "*")
        }
        ,
        on: e => {
            window.addEventListener("message", (t => {
                    const n = nr();
                    try {
                        const o = wo.parse(t.data);
                        t.source === (null == n ? void 0 : n.contentWindow) && o.event === er && e(o.data)
                    } catch (e) {}
                }
            ))
        }
    } : {
        post: e => {}
        ,
        on: e => {}
    }
}
I(),
    I(),
    I(),
    I();
var ar, sr, lr, cr, ur, pr, dr = "__devtools-kit-vite-messaging-event-key__", _r = "vite:client-context", fr = "vite:server-context";
function mr(t) {
    e[_r] = t
}
function Er(t) {
    e[fr] = t
}
function hr() {
    const t = e[_r];
    return {
        post: e => {
            null == t || t.send(dr, wo.stringify(e))
        }
        ,
        on: e => {
            null == t || t.on(dr, (t => {
                    e(wo.parse(t))
                }
            ))
        }
    }
}
function vr() {
    var t;
    const n = e[fr]
        , o = null != (t = n.hot) ? t : n.ws;
    return {
        post: e => null == o ? void 0 : o.send(dr, wo.stringify(e)),
        on: e => null == o ? void 0 : o.on(dr, (t => {
                e(wo.parse(t))
            }
        ))
    }
}
function yr(t) {
    e.__VUE_DEVTOOLS_KIT_RPC_SERVER__ = t
}
function gr() {
    return e.__VUE_DEVTOOLS_KIT_RPC_CLIENT__
}
function Or() {
    return e.__VUE_DEVTOOLS_KIT_RPC_SERVER__
}
function Tr(t) {
    e.__VUE_DEVTOOLS_KIT_VITE_RPC_CLIENT__ = t
}
function Ir(t) {
    e.__VUE_DEVTOOLS_KIT_VITE_RPC_SERVER__ = t
}
function Sr() {
    return e.__VUE_DEVTOOLS_KIT_VITE_RPC_CLIENT__
}
function br() {
    return e.__VUE_DEVTOOLS_KIT_VITE_RPC_SERVER__
}
function Vr(e, t="client") {
    return (0,
        {
            iframe: {
                client: rr,
                server: ir
            }[t],
            electron: {
                client: zo,
                proxy: Bo,
                server: Go
            }[t],
            vite: {
                client: hr,
                server: vr
            }[t],
            broadcast: {
                client: Ro,
                server: Ro
            }[t],
            extension: {
                client: Zo,
                proxy: Jo,
                server: Qo
            }[t]
        }[e])()
}
function kr(t, n={}) {
    const {channel: o, options: r, preset: i} = n
        , a = i ? Vr(i) : o
        , s = p(t, {
        ...r,
        ...a,
        timeout: -1
    });
    if ("vite" !== i)
        return function(t) {
            e.__VUE_DEVTOOLS_KIT_RPC_CLIENT__ = t
        }(s),
            s;
    Tr(s)
}
function Dr(e, t={}) {
    const {channel: n, options: o, preset: r} = t
        , i = r ? Vr(r, "server") : n
        , a = Or();
    if (a)
        a.updateChannels((e => {
                e.push(i)
            }
        ));
    else {
        const t = d(e, [i], {
            ...o,
            timeout: -1
        });
        if ("vite" === r)
            return void Ir(t);
        yr(t)
    }
}
function Cr(e={}) {
    const {channel: t, options: n, preset: o} = e
        , r = o ? Vr(o, "proxy") : t;
    return p({}, {
        ...n,
        ...r,
        timeout: -1
    })
}
function wr(e) {
    const t = {}
        , n = e.getters || {}
        , o = Object.keys(n);
    for (let e = 0; e < o.length; e++) {
        const r = o[e];
        Object.defineProperty(t, r, {
            enumerable: !0,
            get: () => {
                try {
                    return n[r]
                } catch (e) {
                    return e
                }
            }
        })
    }
    return t
}
function Lr(e) {
    if (e.length)
        return e.reduce(( (e, t) => {
                const n = t.type || "data";
                return (e[n] = e[n] || {})[t.key] = t.value,
                    e
            }
        ), {})
}
function Rr(e) {
    const t = {}
        , n = e.length;
    for (let o = 0; o < n; o++) {
        const n = e.item(o);
        t[n.name] = n.value
    }
    return t
}
function Nr(e) {
    let t = (n = e).displayName || n.name || n._componentTag || V(n);
    var n;
    return t ? e.name && e.__file && (t += ` <span>(${e.__file})</span>`) : t = "<i>Unknown Component</i>",
        {
            _custom: {
                type: "component-definition",
                displayText: t,
                tooltipText: "Component definition",
                ...e.__file ? {
                    file: e.__file
                } : {}
            }
        }
}
function Pr(e) {
    var t, n, o, r;
    const i = Mt(e);
    if (i.ref || i.computed || i.reactive) {
        const s = i.computed ? "Computed" : i.ref ? "Ref" : i.reactive ? "Reactive" : null
            , l = jt(i.reactive ? e : U(a = e, "_value", !0) ? a._value : U(a, "value", !0) ? a.value : void 0)
            , c = U(e, "effect") ? (null == (n = null == (t = e.effect) ? void 0 : t.raw) ? void 0 : n.toString()) || (null == (r = null == (o = e.effect) ? void 0 : o.fn) ? void 0 : r.toString()) : null;
        return {
            _custom: {
                type: null == s ? void 0 : s.toLowerCase(),
                stateTypeName: s,
                value: l,
                ...c ? {
                    tooltipText: `<span class="font-mono">${c}</span>`
                } : {}
            }
        }
    }
    var a;
    if (U(e, "__asyncLoader") && "function" == typeof e.__asyncLoader)
        return {
            _custom: {
                type: "component-definition",
                display: "Async component definition"
            }
        }
}
function Ar(e, t, n, o) {
    var r;
    if ("compilerOptions" === e)
        return;
    const i = this[e]
        , a = typeof i;
    if (Array.isArray(i)) {
        const e = i.length;
        return e > 5e3 ? {
            _isArray: !0,
            length: e,
            items: i.slice(0, 5e3)
        } : i
    }
    if ("string" == typeof i)
        return i.length > 1e4 ? `${i.substring(0, 1e4)}... (${i.length} total length)` : i;
    if ("undefined" === a)
        return St;
    if (i === Number.POSITIVE_INFINITY)
        return bt;
    if (i === Number.NEGATIVE_INFINITY)
        return Vt;
    if ("function" == typeof i)
        return function(e) {
            let t = ""
                , n = null;
            try {
                t = Function.prototype.toString.call(e),
                    n = String.prototype.match.call(t, /\([\s\S]*?\)/)
            } catch (e) {}
            const o = n && n[0]
                , r = "string" == typeof o ? o : "(?)";
            return {
                _custom: {
                    type: "function",
                    displayText: `<span style="opacity:.8;margin-right:5px;">function</span> <span style="white-space:nowrap;">${Kt("string" == typeof e.name ? e.name : "")}${r}</span>`,
                    tooltipText: t.trim() ? `<pre>${t}</pre>` : null
                }
            }
        }(i);
    if ("symbol" === a)
        return `[native Symbol ${Symbol.prototype.toString.call(i)}]`;
    if ("bigint" == typeof i)
        return function(e) {
            const t = BigInt.prototype.toString.call(e);
            return {
                _custom: {
                    type: "bigint",
                    displayText: `BigInt(${t})`,
                    value: t
                }
            }
        }(i);
    if (null !== i && "object" == typeof i) {
        const e = Object.prototype.toString.call(i);
        if ("[object Map]" === e)
            return function(e) {
                return {
                    _custom: {
                        type: "map",
                        displayText: "Map",
                        value: Object.fromEntries(e),
                        readOnly: !0,
                        fields: {
                            abstract: !0
                        }
                    }
                }
            }(i);
        if ("[object Set]" === e)
            return function(e) {
                const t = Array.from(e);
                return {
                    _custom: {
                        type: "set",
                        displayText: `Set[${t.length}]`,
                        value: t,
                        readOnly: !0
                    }
                }
            }(i);
        if ("[object RegExp]" === e)
            return `[native RegExp ${RegExp.prototype.toString.call(i)}]`;
        if ("[object Date]" === e)
            return function(e) {
                const t = new Date(e.getTime());
                return t.setMinutes(t.getMinutes() - t.getTimezoneOffset()),
                    {
                        _custom: {
                            type: "date",
                            displayText: Date.prototype.toString.call(e),
                            value: t.toISOString().slice(0, -1)
                        }
                    }
            }(i);
        if ("[object Error]" === e)
            return `[native Error ${i.message}<>${i.stack}]`;
        if (U(i, "state", !0) && U(i, "_vm", !0))
            return {
                _custom: {
                    type: "store",
                    displayText: "Store",
                    value: {
                        state: (l = i).state,
                        getters: wr(l)
                    },
                    fields: {
                        abstract: !0
                    }
                }
            };
        if (i.constructor && "VueRouter" === i.constructor.name)
            return {
                _custom: {
                    type: "router",
                    displayText: "VueRouter",
                    value: {
                        options: (s = i).options,
                        currentRoute: s.currentRoute
                    },
                    fields: {
                        abstract: !0
                    }
                }
            };
        if (Ct(i)) {
            const e = function(e) {
                e._ && (e = e._);
                const t = Ht(e);
                return {
                    _custom: {
                        type: "component",
                        id: e.__VUE_DEVTOOLS_NEXT_UID__,
                        displayText: R(e),
                        tooltipText: "Component instance",
                        value: Lr(t),
                        fields: {
                            abstract: !0
                        }
                    }
                }
            }(i)
                , t = null == o ? void 0 : o.get(i);
            return t && t < n ? `[[CircularRef]] <${e._custom.displayText}>` : (null == o || o.set(i, n),
                e)
        }
        if (U(i, "render", !0) && "function" == typeof i.render)
            return Nr(i);
        if (i.constructor && "VNode" === i.constructor.name)
            return `[native VNode <${i.tag}>]`;
        if ("undefined" != typeof HTMLElement && i instanceof HTMLElement)
            return function(e) {
                try {
                    return {
                        _custom: {
                            type: "HTMLElement",
                            displayText: `<span class="opacity-30">&lt;</span><span class="text-blue-500">${e.tagName.toLowerCase()}</span><span class="opacity-30">&gt;</span>`,
                            value: Rr(e.attributes)
                        }
                    }
                } catch (t) {
                    return {
                        _custom: {
                            type: "HTMLElement",
                            displayText: `<span class="text-blue-500">${String(e)}</span>`
                        }
                    }
                }
            }(i);
        if ("Store" === (null == (r = i.constructor) ? void 0 : r.name) && "_wrappedGetters"in i)
            return "[object Store]";
        if (U(i, "currentRoute", !0))
            return "[object Router]";
        const t = Pr(i);
        if (null != t)
            return t
    } else if (Number.isNaN(i))
        return kt;
    var s, l, c;
    return function(e) {
        if (null == e)
            return !0;
        const t = typeof e;
        return "string" === t || "number" === t || "boolean" === t
    }(c = i) || Array.isArray(c) || wt(c) ? c : Object.prototype.toString.call(c)
}
I(),
    I(),
    I(),
    I(),
    I(),
null != (ar = e).__VUE_DEVTOOLS_KIT_MESSAGE_CHANNELS__ || (ar.__VUE_DEVTOOLS_KIT_MESSAGE_CHANNELS__ = []),
null != (sr = e).__VUE_DEVTOOLS_KIT_RPC_CLIENT__ || (sr.__VUE_DEVTOOLS_KIT_RPC_CLIENT__ = null),
null != (lr = e).__VUE_DEVTOOLS_KIT_RPC_SERVER__ || (lr.__VUE_DEVTOOLS_KIT_RPC_SERVER__ = null),
null != (cr = e).__VUE_DEVTOOLS_KIT_VITE_RPC_CLIENT__ || (cr.__VUE_DEVTOOLS_KIT_VITE_RPC_CLIENT__ = null),
null != (ur = e).__VUE_DEVTOOLS_KIT_VITE_RPC_SERVER__ || (ur.__VUE_DEVTOOLS_KIT_VITE_RPC_SERVER__ = null),
null != (pr = e).__VUE_DEVTOOLS_KIT_BROADCAST_RPC_SERVER__ || (pr.__VUE_DEVTOOLS_KIT_BROADCAST_RPC_SERVER__ = null),
    I(),
    I(),
    I(),
    I(),
    I(),
    I(),
    I();
var Ur = 2097152;
function xr(e, t) {
    return "[object Object]" === t
}
function Mr(e, t, n, o, r=0, i=new Map) {
    let a, s, l, c, u;
    const p = o.get(e);
    if (null != p)
        return p;
    const d = n.length
        , _ = Object.prototype.toString.call(e);
    if (xr(0, _)) {
        if (function(e) {
            var t;
            const n = null == (t = null == e ? void 0 : e.constructor) ? void 0 : t.name;
            return "Dep" === n && "activeLink"in e || "Link" === n && "dep"in e
        }(e))
            return d;
        a = {},
            o.set(e, d),
            n.push(a);
        const p = Object.keys(e);
        for (c = 0,
                 u = p.length; c < u; c++) {
            if (s = p[c],
            "compilerOptions" === s)
                return d;
            l = e[s];
            const u = null != l && xr(0, Object.prototype.toString.call(e)) && Ct(l);
            try {
                t && (l = t.call(e, s, l, r, i))
            } catch (e) {
                l = e
            }
            a[s] = Mr(l, t, n, o, r + 1, i),
            u && i.delete(l)
        }
    } else if (function(e, t) {
        return "[object Array]" === t
    }(0, _))
        for (a = [],
                 o.set(e, d),
                 n.push(a),
                 c = 0,
                 u = e.length; c < u; c++) {
            try {
                l = e[c],
                t && (l = t.call(e, c, l, r, i))
            } catch (e) {
                l = e
            }
            a[c] = Mr(l, t, n, o, r + 1, i)
        }
    else
        n.push(e);
    return d
}
function jr(e, t=null, n=null) {
    let o;
    try {
        o = 1 === arguments.length ? JSON.stringify(e) : JSON.stringify(e, ( (e, n) => {
                var o;
                return null == (o = null == t ? void 0 : t(e, n)) ? void 0 : o.call(this)
            }
        ), n)
    } catch (r) {
        o = function(e, t=null, n=null) {
            const o = [];
            return Mr(e, t, o, new Map),
                n ? ` ${JSON.stringify(o, null, n)}` : ` ${JSON.stringify(o)}`
        }(e, t, n)
    }
    if (o.length > Ur) {
        const e = Math.ceil(o.length / Ur)
            , t = [];
        for (let n = 0; n < e; n++)
            t.push(o.slice(n * Ur, (n + 1) * Ur));
        return t
    }
    return o
}
function Kr(e, t=null) {
    Array.isArray(e) && (e = e.join(""));
    if (/^\s/.test(e)) {
        const n = JSON.parse(e);
        return function(e, t=null) {
            let n, o, r, i, a, s, l = e.length;
            for (; l--; )
                if (r = e[l],
                    s = Object.prototype.toString.call(r),
                "[object Object]" === s) {
                    const s = Object.keys(r);
                    for (n = 0,
                             o = s.length; n < o; n++)
                        i = s[n],
                            a = e[r[i]],
                        t && (a = t.call(r, i, a)),
                            r[i] = a
                } else if ("[object Array]" === s)
                    for (n = 0,
                             o = r.length; n < o; n++)
                        a = e[r[n]],
                        t && (a = t.call(r, n, a)),
                            r[n] = a
        }(n, t),
            n[0]
    }
    return 1 === arguments.length ? JSON.parse(e) : JSON.parse(e, t)
}
function $r(e) {
    return jr(e, Ar)
}
function Hr(e, t=!1) {
    return null == e ? {} : t ? Kr(e, Nn) : Kr(e)
}
var zr = {
    hook: ht,
    init: () => {
        Cn()
    }
    ,
    get ctx() {
        return yn
    },
    get api() {
        return yn.api
    }
};
export {Ne as DevToolsContextHookKeys, Pe as DevToolsMessagingHookKeys, Re as DevToolsV6PluginAPIHookKeys, bt as INFINITY, kt as NAN, Vt as NEGATIVE_INFINITY, ln as ROUTER_INFO_KEY, sn as ROUTER_KEY, St as UNDEFINED, Be as activeAppRecord, tt as addCustomCommand, et as addCustomTab, He as addDevToolsAppRecord, ct as addDevToolsPluginToBuffer, Oe as addInspector, Ke as callConnectedUpdatedHook, tn as callDevToolsPluginSetupFn, ge as callInspectorUpdatedHook, je as callStateUpdatedHook, Qt as createComponentsDevToolsPlugin, fn as createDevToolsApi, Ae as createDevToolsCtxHooks, kr as createRpcClient, Cr as createRpcProxy, Dr as createRpcServer, zr as devtools, $e as devtoolsAppRecords, yn as devtoolsContext, ye as devtoolsInspector, lt as devtoolsPluginBuffer, pn as devtoolsRouter, un as devtoolsRouterInfo, Ye as devtoolsState, Kt as escape, An as formatInspectorStateValue, Te as getActiveInspectors, mn as getDevToolsEnv, qo as getExtensionClientContext, Se as getInspector, be as getInspectorActions, Ie as getInspectorInfo, Ve as getInspectorNodeActions, Pn as getInspectorStateValueType, xn as getRaw, gr as getRpcClient, Or as getRpcServer, Sr as getViteRpcClient, br as getViteRpcServer, Cn as initDevTools, wt as isPlainObject, wn as onDevToolsClientConnected, Ze as onDevToolsConnected, Hr as parse, on as registerDevToolsPlugin, nt as removeCustomCommand, ze as removeDevToolsAppRecord, nn as removeRegisteredPluginApp, qe as resetDevToolsState, Fe as setActiveAppRecord, Xe as setActiveAppRecordId, En as setDevToolsEnv, Ko as setElectronClientContext, $o as setElectronProxyContext, Ho as setElectronServerContext, Wo as setExtensionClientContext, or as setIframeServerContext, rt as setOpenInEditorBaseUrl, yr as setRpcServerToGlobal, mr as setViteClientContext, Tr as setViteRpcClientToGlobal, Ir as setViteRpcServerToGlobal, Er as setViteServerContext, en as setupDevToolsPlugin, $r as stringify, Mn as toEdit, jn as toSubmit, ot as toggleClientConnected, re as toggleComponentInspectorEnabled, Ln as toggleHighPerfMode, Kn as updateDevToolsClientDetected, We as updateDevToolsState, ve as updateTimelineLayersState};
export default null;
//# sourceMappingURL=/sm/a62c6efc1c899c377283f7e38135d23cc594ec58c88c3d2704082bb4017a29ef.map
